; ModuleID = 'xdp_prog_kern_port.c'
source_filename = "xdp_prog_kern_port.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.scan = type { i32, i32, [4 x i32], [4 x i32], i32, i32, i32, i32, i64, i64, i8 }

@port_map = global %struct.bpf_map_def { i32 2, i32 4, i32 80, i32 200000, i32 0 }, section "maps", align 4, !dbg !0
@process_packet.____fmt = private unnamed_addr constant [21 x i8] c"Hash: %d - key: %d \0A\00", align 1
@process_packet.____fmt.1 = private unnamed_addr constant [24 x i8] c"First time entry used \0A\00", align 1
@process_packet.____fmt.2 = private unnamed_addr constant [26 x i8] c"Updating existing entry \0A\00", align 1
@process_packet.____fmt.3 = private unnamed_addr constant [18 x i8] c"Reuse old entry \0A\00", align 1
@process_packet.____fmt.4 = private unnamed_addr constant [15 x i8] c"Flow ignored \0A\00", align 1
@_license = global [4 x i8] c"GPL\00", section "license", align 1, !dbg !49
@parse_tcp.____fmt = private unnamed_addr constant [14 x i8] c"tcp syn: %d \0A\00", align 1
@parse_tcp.____fmt.5 = private unnamed_addr constant [14 x i8] c"tcp rst: %d \0A\00", align 1
@parse_udp.____fmt = private unnamed_addr constant [30 x i8] c"Increment udp empty counter \0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "port_map", scope: !2, file: !3, line: 28, type: !80, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !42, globals: !48)
!3 = !DIFile(filename: "xdp_prog_kern_port.c", directory: "/home/francois/Documents/TFE/XDP-Code/port-scan-stats")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 876, size: 32, elements: !7)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "/home/francois/Documents/TFE/XDP-Code/port-scan-stats")
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!9 = !DIEnumerator(name: "XDP_DROP", value: 1)
!10 = !DIEnumerator(name: "XDP_PASS", value: 2)
!11 = !DIEnumerator(name: "XDP_TX", value: 3)
!12 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 28, size: 32, elements: !15)
!14 = !DIFile(filename: "/usr/include/linux/in.h", directory: "/home/francois/Documents/TFE/XDP-Code/port-scan-stats")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!16 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!17 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!18 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!19 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!20 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!21 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!22 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!23 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!24 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!25 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!26 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!27 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!28 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!29 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!30 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!31 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!32 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!33 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!34 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!35 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!36 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!37 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!38 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!39 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!40 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!41 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!42 = !{!43, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !46, line: 24, baseType: !47)
!46 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/francois/Documents/TFE/XDP-Code/port-scan-stats")
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !{!0, !49, !55, !66, !73}
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 281, type: !51, isLocal: false, isDefinition: true)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 32, elements: !53)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!53 = !{!54}
!54 = !DISubrange(count: 4)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !57, line: 152, type: !58, isLocal: true, isDefinition: true)
!57 = !DIFile(filename: "../dependencies/libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/francois/Documents/TFE/XDP-Code/port-scan-stats")
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !62, !64, null}
!61 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !46, line: 27, baseType: !65)
!65 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !57, line: 33, type: !68, isLocal: true, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!43, !43, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !57, line: 89, type: !75, isLocal: true, isDefinition: true)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !46, line: 31, baseType: !79)
!79 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !81, line: 33, size: 160, elements: !82)
!81 = !DIFile(filename: "../dependencies/libbpf/src//build/usr/include/bpf/bpf_helpers.h", directory: "/home/francois/Documents/TFE/XDP-Code/port-scan-stats")
!82 = !{!83, !84, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !81, line: 34, baseType: !65, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !80, file: !81, line: 35, baseType: !65, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !80, file: !81, line: 36, baseType: !65, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !80, file: !81, line: 37, baseType: !65, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !80, file: !81, line: 38, baseType: !65, size: 32, offset: 128)
!88 = !{i32 2, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{i32 1, !"wchar_size", i32 4}
!91 = !{!"clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)"}
!92 = distinct !DISubprogram(name: "process_packet", scope: !3, file: !3, line: 132, type: !93, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !101)
!93 = !DISubroutineType(types: !94)
!94 = !{!61, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 887, size: 96, elements: !97)
!97 = !{!98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !6, line: 888, baseType: !64, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !96, file: !6, line: 889, baseType: !64, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !96, file: !6, line: 890, baseType: !64, size: 32, offset: 64)
!101 = !{!102, !103, !104, !105, !124, !137, !138, !140, !141, !142, !143, !144, !145, !146, !153, !160, !168, !176}
!102 = !DILocalVariable(name: "ctx", arg: 1, scope: !92, file: !3, line: 132, type: !95)
!103 = !DILocalVariable(name: "data_end", scope: !92, file: !3, line: 134, type: !43)
!104 = !DILocalVariable(name: "data", scope: !92, file: !3, line: 135, type: !43)
!105 = !DILocalVariable(name: "v", scope: !92, file: !3, line: 136, type: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "scan", file: !108, line: 10, size: 640, elements: !109)
!108 = !DIFile(filename: "./common_kern_user.h", directory: "/home/francois/Documents/TFE/XDP-Code/port-scan-stats")
!109 = !{!110, !111, !112, !114, !115, !116, !117, !118, !119, !120, !121}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !107, file: !108, line: 11, baseType: !64, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !107, file: !108, line: 12, baseType: !64, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "srcv6", scope: !107, file: !108, line: 13, baseType: !113, size: 128, offset: 64)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !53)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !107, file: !108, line: 14, baseType: !113, size: 128, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "dstport", scope: !107, file: !108, line: 15, baseType: !64, size: 32, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "csyn", scope: !107, file: !108, line: 16, baseType: !64, size: 32, offset: 352)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "crst", scope: !107, file: !108, line: 17, baseType: !64, size: 32, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "empty_udp", scope: !107, file: !108, line: 18, baseType: !64, size: 32, offset: 416)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_start", scope: !107, file: !108, line: 19, baseType: !78, size: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_last_m", scope: !107, file: !108, line: 20, baseType: !78, size: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !107, file: !108, line: 21, baseType: !122, size: 8, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !46, line: 21, baseType: !123)
!123 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DILocalVariable(name: "eth", scope: !92, file: !3, line: 137, type: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !127, line: 159, size: 112, elements: !128)
!127 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "/home/francois/Documents/TFE/XDP-Code/port-scan-stats")
!128 = !{!129, !133, !134}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !126, file: !127, line: 160, baseType: !130, size: 48)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 48, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 6)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !126, file: !127, line: 161, baseType: !130, size: 48, offset: 48)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !126, file: !127, line: 162, baseType: !135, size: 16, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !136, line: 25, baseType: !45)
!136 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/francois/Documents/TFE/XDP-Code/port-scan-stats")
!137 = !DILocalVariable(name: "f", scope: !92, file: !3, line: 138, type: !107)
!138 = !DILocalVariable(name: "use_encap", scope: !92, file: !3, line: 139, type: !139)
!139 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!140 = !DILocalVariable(name: "is_ip6", scope: !92, file: !3, line: 140, type: !139)
!141 = !DILocalVariable(name: "jhash", scope: !92, file: !3, line: 141, type: !139)
!142 = !DILocalVariable(name: "eth_proto", scope: !92, file: !3, line: 142, type: !64)
!143 = !DILocalVariable(name: "hash", scope: !92, file: !3, line: 143, type: !64)
!144 = !DILocalVariable(name: "key", scope: !92, file: !3, line: 144, type: !64)
!145 = !DILocalVariable(name: "off", scope: !92, file: !3, line: 145, type: !64)
!146 = !DILocalVariable(name: "____fmt", scope: !147, file: !3, line: 217, type: !150)
!147 = distinct !DILexicalBlock(scope: !148, file: !3, line: 217, column: 9)
!148 = distinct !DILexicalBlock(scope: !149, file: !3, line: 213, column: 2)
!149 = distinct !DILexicalBlock(scope: !92, file: !3, line: 212, column: 6)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 168, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 21)
!153 = !DILocalVariable(name: "____fmt", scope: !154, file: !3, line: 228, type: !157)
!154 = distinct !DILexicalBlock(scope: !155, file: !3, line: 228, column: 6)
!155 = distinct !DILexicalBlock(scope: !156, file: !3, line: 227, column: 2)
!156 = distinct !DILexicalBlock(scope: !92, file: !3, line: 226, column: 5)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 192, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 24)
!160 = !DILocalVariable(name: "____fmt", scope: !161, file: !3, line: 246, type: !165)
!161 = distinct !DILexicalBlock(scope: !162, file: !3, line: 246, column: 4)
!162 = distinct !DILexicalBlock(scope: !163, file: !3, line: 244, column: 3)
!163 = distinct !DILexicalBlock(scope: !164, file: !3, line: 243, column: 6)
!164 = distinct !DILexicalBlock(scope: !156, file: !3, line: 242, column: 2)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 208, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 26)
!168 = !DILocalVariable(name: "____fmt", scope: !169, file: !3, line: 258, type: !173)
!169 = distinct !DILexicalBlock(scope: !170, file: !3, line: 258, column: 5)
!170 = distinct !DILexicalBlock(scope: !171, file: !3, line: 256, column: 4)
!171 = distinct !DILexicalBlock(scope: !172, file: !3, line: 255, column: 7)
!172 = distinct !DILexicalBlock(scope: !163, file: !3, line: 253, column: 3)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 144, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 18)
!176 = !DILocalVariable(name: "____fmt", scope: !177, file: !3, line: 275, type: !179)
!177 = distinct !DILexicalBlock(scope: !178, file: !3, line: 275, column: 5)
!178 = distinct !DILexicalBlock(scope: !171, file: !3, line: 274, column: 4)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 120, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 15)
!182 = !DILocalVariable(name: "____fmt", scope: !183, file: !3, line: 63, type: !204)
!183 = distinct !DILexicalBlock(scope: !184, file: !3, line: 63, column: 3)
!184 = distinct !DILexicalBlock(scope: !185, file: !3, line: 61, column: 2)
!185 = distinct !DILexicalBlock(scope: !186, file: !3, line: 60, column: 5)
!186 = distinct !DISubprogram(name: "parse_udp", scope: !3, file: !3, line: 50, type: !187, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !189)
!187 = !DISubroutineType(types: !188)
!188 = !{!139, !43, !78, !43, !106}
!189 = !{!190, !191, !192, !193, !194, !182}
!190 = !DILocalVariable(name: "data", arg: 1, scope: !186, file: !3, line: 50, type: !43)
!191 = !DILocalVariable(name: "off", arg: 2, scope: !186, file: !3, line: 50, type: !78)
!192 = !DILocalVariable(name: "data_end", arg: 3, scope: !186, file: !3, line: 50, type: !43)
!193 = !DILocalVariable(name: "f", arg: 4, scope: !186, file: !3, line: 51, type: !106)
!194 = !DILocalVariable(name: "udp", scope: !186, file: !3, line: 53, type: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !197, line: 23, size: 64, elements: !198)
!197 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "/home/francois/Documents/TFE/XDP-Code/port-scan-stats")
!198 = !{!199, !200, !201, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !196, file: !197, line: 24, baseType: !135, size: 16)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !196, file: !197, line: 25, baseType: !135, size: 16, offset: 16)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !196, file: !197, line: 26, baseType: !135, size: 16, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !196, file: !197, line: 27, baseType: !203, size: 16, offset: 48)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !136, line: 31, baseType: !45)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 240, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 30)
!207 = !DILocation(line: 63, column: 3, scope: !183, inlinedAt: !208)
!208 = distinct !DILocation(line: 204, column: 8, scope: !209)
!209 = distinct !DILexicalBlock(scope: !210, file: !3, line: 204, column: 7)
!210 = distinct !DILexicalBlock(scope: !211, file: !3, line: 203, column: 2)
!211 = distinct !DILexicalBlock(scope: !212, file: !3, line: 202, column: 11)
!212 = distinct !DILexicalBlock(scope: !92, file: !3, line: 197, column: 6)
!213 = !DILocalVariable(name: "____fmt", scope: !214, file: !3, line: 83, type: !250)
!214 = distinct !DILexicalBlock(scope: !215, file: !3, line: 83, column: 3)
!215 = distinct !DILexicalBlock(scope: !216, file: !3, line: 81, column: 2)
!216 = distinct !DILexicalBlock(scope: !217, file: !3, line: 80, column: 5)
!217 = distinct !DISubprogram(name: "parse_tcp", scope: !3, file: !3, line: 70, type: !187, isLocal: true, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !218)
!218 = !{!219, !220, !221, !222, !223, !213, !246}
!219 = !DILocalVariable(name: "data", arg: 1, scope: !217, file: !3, line: 70, type: !43)
!220 = !DILocalVariable(name: "off", arg: 2, scope: !217, file: !3, line: 70, type: !78)
!221 = !DILocalVariable(name: "data_end", arg: 3, scope: !217, file: !3, line: 70, type: !43)
!222 = !DILocalVariable(name: "f", arg: 4, scope: !217, file: !3, line: 71, type: !106)
!223 = !DILocalVariable(name: "tcp", scope: !217, file: !3, line: 73, type: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !226, line: 25, size: 160, elements: !227)
!226 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "/home/francois/Documents/TFE/XDP-Code/port-scan-stats")
!227 = !{!228, !229, !230, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !225, file: !226, line: 26, baseType: !135, size: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !225, file: !226, line: 27, baseType: !135, size: 16, offset: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !225, file: !226, line: 28, baseType: !231, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !136, line: 27, baseType: !64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !225, file: !226, line: 29, baseType: !231, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !225, file: !226, line: 31, baseType: !45, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !225, file: !226, line: 32, baseType: !45, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !225, file: !226, line: 33, baseType: !45, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !225, file: !226, line: 34, baseType: !45, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !225, file: !226, line: 35, baseType: !45, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !225, file: !226, line: 36, baseType: !45, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !225, file: !226, line: 37, baseType: !45, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !225, file: !226, line: 38, baseType: !45, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !225, file: !226, line: 39, baseType: !45, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !225, file: !226, line: 40, baseType: !45, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !225, file: !226, line: 55, baseType: !135, size: 16, offset: 112)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !225, file: !226, line: 56, baseType: !203, size: 16, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !225, file: !226, line: 57, baseType: !135, size: 16, offset: 144)
!246 = !DILocalVariable(name: "____fmt", scope: !247, file: !3, line: 89, type: !250)
!247 = distinct !DILexicalBlock(scope: !248, file: !3, line: 89, column: 3)
!248 = distinct !DILexicalBlock(scope: !249, file: !3, line: 87, column: 2)
!249 = distinct !DILexicalBlock(scope: !217, file: !3, line: 86, column: 5)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 112, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 14)
!253 = !DILocation(line: 83, column: 3, scope: !214, inlinedAt: !254)
!254 = distinct !DILocation(line: 199, column: 8, scope: !255)
!255 = distinct !DILexicalBlock(scope: !256, file: !3, line: 199, column: 7)
!256 = distinct !DILexicalBlock(scope: !212, file: !3, line: 198, column: 2)
!257 = !DILocation(line: 89, column: 3, scope: !247, inlinedAt: !254)
!258 = !DILocation(line: 132, column: 35, scope: !92)
!259 = !DILocation(line: 134, column: 38, scope: !92)
!260 = !{!261, !262, i64 4}
!261 = !{!"xdp_md", !262, i64 0, !262, i64 4, !262, i64 8}
!262 = !{!"int", !263, i64 0}
!263 = !{!"omnipotent char", !264, i64 0}
!264 = !{!"Simple C/C++ TBAA"}
!265 = !DILocation(line: 134, column: 27, scope: !92)
!266 = !DILocation(line: 134, column: 19, scope: !92)
!267 = !DILocation(line: 134, column: 8, scope: !92)
!268 = !DILocation(line: 135, column: 34, scope: !92)
!269 = !{!261, !262, i64 0}
!270 = !DILocation(line: 135, column: 23, scope: !92)
!271 = !DILocation(line: 135, column: 15, scope: !92)
!272 = !DILocation(line: 135, column: 8, scope: !92)
!273 = !DILocation(line: 137, column: 17, scope: !92)
!274 = !DILocation(line: 139, column: 7, scope: !92)
!275 = !DILocation(line: 140, column: 7, scope: !92)
!276 = !DILocation(line: 141, column: 7, scope: !92)
!277 = !DILocation(line: 144, column: 2, scope: !92)
!278 = !DILocation(line: 144, column: 8, scope: !92)
!279 = !DILocation(line: 147, column: 6, scope: !92)
!280 = !{!262, !262, i64 0}
!281 = !DILocation(line: 145, column: 8, scope: !92)
!282 = !DILocation(line: 152, column: 11, scope: !283)
!283 = distinct !DILexicalBlock(scope: !92, file: !3, line: 152, column: 6)
!284 = !DILocation(line: 152, column: 17, scope: !283)
!285 = !DILocation(line: 152, column: 6, scope: !92)
!286 = !DILocation(line: 137, column: 23, scope: !92)
!287 = !DILocation(line: 155, column: 19, scope: !92)
!288 = !{!289, !290, i64 12}
!289 = !{!"ethhdr", !263, i64 0, !263, i64 6, !290, i64 12}
!290 = !{!"short", !263, i64 0}
!291 = !DILocation(line: 157, column: 6, scope: !92)
!292 = !DILocation(line: 138, column: 14, scope: !92)
!293 = !DILocalVariable(name: "off", arg: 2, scope: !294, file: !3, line: 95, type: !78)
!294 = distinct !DISubprogram(name: "parse_ip4", scope: !3, file: !3, line: 95, type: !187, isLocal: true, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !295)
!295 = !{!296, !293, !297, !298, !299}
!296 = !DILocalVariable(name: "data", arg: 1, scope: !294, file: !3, line: 95, type: !43)
!297 = !DILocalVariable(name: "data_end", arg: 3, scope: !294, file: !3, line: 95, type: !43)
!298 = !DILocalVariable(name: "f", arg: 4, scope: !294, file: !3, line: 96, type: !106)
!299 = !DILocalVariable(name: "iph", scope: !294, file: !3, line: 98, type: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !302, line: 86, size: 160, elements: !303)
!302 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "/home/francois/Documents/TFE/XDP-Code/port-scan-stats")
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !301, file: !302, line: 88, baseType: !122, size: 4, flags: DIFlagBitField, extraData: i64 0)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !301, file: !302, line: 89, baseType: !122, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !301, file: !302, line: 96, baseType: !122, size: 8, offset: 8)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !301, file: !302, line: 97, baseType: !135, size: 16, offset: 16)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !301, file: !302, line: 98, baseType: !135, size: 16, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !301, file: !302, line: 99, baseType: !135, size: 16, offset: 48)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !301, file: !302, line: 100, baseType: !122, size: 8, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !301, file: !302, line: 101, baseType: !122, size: 8, offset: 72)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !301, file: !302, line: 102, baseType: !203, size: 16, offset: 80)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !301, file: !302, line: 103, baseType: !231, size: 32, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !301, file: !302, line: 104, baseType: !231, size: 32, offset: 128)
!315 = !DILocation(line: 95, column: 57, scope: !294, inlinedAt: !316)
!316 = distinct !DILocation(line: 158, column: 8, scope: !317)
!317 = distinct !DILexicalBlock(scope: !318, file: !3, line: 158, column: 7)
!318 = distinct !DILexicalBlock(scope: !319, file: !3, line: 157, column: 40)
!319 = distinct !DILexicalBlock(scope: !92, file: !3, line: 157, column: 6)
!320 = !DILocation(line: 101, column: 10, scope: !321, inlinedAt: !316)
!321 = distinct !DILexicalBlock(scope: !294, file: !3, line: 101, column: 6)
!322 = !DILocation(line: 101, column: 14, scope: !321, inlinedAt: !316)
!323 = !DILocation(line: 101, column: 6, scope: !294, inlinedAt: !316)
!324 = !DILocation(line: 104, column: 11, scope: !325, inlinedAt: !316)
!325 = distinct !DILexicalBlock(scope: !294, file: !3, line: 104, column: 6)
!326 = !DILocation(line: 104, column: 15, scope: !325, inlinedAt: !316)
!327 = !DILocation(line: 104, column: 6, scope: !294, inlinedAt: !316)
!328 = !DILocation(line: 107, column: 16, scope: !294, inlinedAt: !316)
!329 = !{!330, !262, i64 12}
!330 = !{!"iphdr", !263, i64 0, !263, i64 0, !263, i64 1, !290, i64 2, !290, i64 4, !290, i64 6, !263, i64 8, !263, i64 9, !290, i64 10, !262, i64 12, !262, i64 16}
!331 = !DILocation(line: 108, column: 16, scope: !294, inlinedAt: !316)
!332 = !{!330, !262, i64 16}
!333 = !DILocation(line: 109, column: 21, scope: !294, inlinedAt: !316)
!334 = !DILocation(line: 158, column: 7, scope: !318)
!335 = !DILocalVariable(name: "off", arg: 2, scope: !336, file: !3, line: 114, type: !78)
!336 = distinct !DISubprogram(name: "parse_ip6", scope: !3, file: !3, line: 114, type: !187, isLocal: true, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !337)
!337 = !{!338, !335, !339, !340, !341}
!338 = !DILocalVariable(name: "data", arg: 1, scope: !336, file: !3, line: 114, type: !43)
!339 = !DILocalVariable(name: "data_end", arg: 3, scope: !336, file: !3, line: 114, type: !43)
!340 = !DILocalVariable(name: "f", arg: 4, scope: !336, file: !3, line: 115, type: !106)
!341 = !DILocalVariable(name: "ip6h", scope: !336, file: !3, line: 117, type: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !344, line: 116, size: 320, elements: !345)
!344 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "/home/francois/Documents/TFE/XDP-Code/port-scan-stats")
!345 = !{!346, !347, !348, !352, !353, !354, !355, !372}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !343, file: !344, line: 118, baseType: !122, size: 4, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !343, file: !344, line: 119, baseType: !122, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !343, file: !344, line: 126, baseType: !349, size: 24, offset: 8)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 24, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 3)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !343, file: !344, line: 128, baseType: !135, size: 16, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !343, file: !344, line: 129, baseType: !122, size: 8, offset: 48)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !343, file: !344, line: 130, baseType: !122, size: 8, offset: 56)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !343, file: !344, line: 132, baseType: !356, size: 128, offset: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !357, line: 33, size: 128, elements: !358)
!357 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "/home/francois/Documents/TFE/XDP-Code/port-scan-stats")
!358 = !{!359}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !356, file: !357, line: 40, baseType: !360, size: 128)
!360 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !356, file: !357, line: 34, size: 128, elements: !361)
!361 = !{!362, !366, !370}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !360, file: !357, line: 35, baseType: !363, size: 128)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 128, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 16)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !360, file: !357, line: 37, baseType: !367, size: 128)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 128, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 8)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !360, file: !357, line: 38, baseType: !371, size: 128)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 128, elements: !53)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !343, file: !344, line: 133, baseType: !356, size: 128, offset: 192)
!373 = !DILocation(line: 114, column: 57, scope: !336, inlinedAt: !374)
!374 = distinct !DILocation(line: 162, column: 8, scope: !375)
!375 = distinct !DILexicalBlock(scope: !376, file: !3, line: 162, column: 7)
!376 = distinct !DILexicalBlock(scope: !377, file: !3, line: 161, column: 49)
!377 = distinct !DILexicalBlock(scope: !319, file: !3, line: 161, column: 13)
!378 = !DILocation(line: 117, column: 18, scope: !336, inlinedAt: !374)
!379 = !DILocation(line: 120, column: 11, scope: !380, inlinedAt: !374)
!380 = distinct !DILexicalBlock(scope: !336, file: !3, line: 120, column: 6)
!381 = !DILocation(line: 120, column: 15, scope: !380, inlinedAt: !374)
!382 = !DILocation(line: 120, column: 6, scope: !336, inlinedAt: !374)
!383 = !DILocation(line: 123, column: 2, scope: !336, inlinedAt: !374)
!384 = !DILocation(line: 124, column: 2, scope: !336, inlinedAt: !374)
!385 = !DILocation(line: 125, column: 22, scope: !336, inlinedAt: !374)
!386 = !DILocation(line: 162, column: 7, scope: !376)
!387 = !{!263, !263, i64 0}
!388 = !DILocation(line: 171, column: 6, scope: !92)
!389 = !DILocation(line: 179, column: 7, scope: !390)
!390 = distinct !DILexicalBlock(scope: !391, file: !3, line: 172, column: 2)
!391 = distinct !DILexicalBlock(scope: !92, file: !3, line: 171, column: 6)
!392 = !DILocation(line: 180, column: 2, scope: !390)
!393 = !DILocation(line: 189, column: 7, scope: !394)
!394 = distinct !DILexicalBlock(scope: !395, file: !3, line: 182, column: 2)
!395 = distinct !DILexicalBlock(scope: !391, file: !3, line: 181, column: 11)
!396 = !DILocation(line: 190, column: 2, scope: !394)
!397 = !DILocation(line: 192, column: 11, scope: !398)
!398 = distinct !DILexicalBlock(scope: !92, file: !3, line: 192, column: 6)
!399 = !DILocation(line: 192, column: 17, scope: !398)
!400 = !DILocation(line: 192, column: 6, scope: !92)
!401 = !DILocation(line: 197, column: 6, scope: !92)
!402 = !DILocation(line: 70, column: 45, scope: !217, inlinedAt: !254)
!403 = !DILocation(line: 70, column: 57, scope: !217, inlinedAt: !254)
!404 = !DILocation(line: 70, column: 68, scope: !217, inlinedAt: !254)
!405 = !DILocation(line: 71, column: 24, scope: !217, inlinedAt: !254)
!406 = !DILocation(line: 73, column: 17, scope: !217, inlinedAt: !254)
!407 = !DILocation(line: 76, column: 10, scope: !408, inlinedAt: !254)
!408 = distinct !DILexicalBlock(scope: !217, file: !3, line: 76, column: 6)
!409 = !DILocation(line: 76, column: 14, scope: !408, inlinedAt: !254)
!410 = !DILocation(line: 76, column: 6, scope: !217, inlinedAt: !254)
!411 = !DILocation(line: 79, column: 14, scope: !217, inlinedAt: !254)
!412 = !{!413, !290, i64 2}
!413 = !{!"tcphdr", !290, i64 0, !290, i64 2, !262, i64 4, !262, i64 8, !290, i64 12, !290, i64 12, !290, i64 13, !290, i64 13, !290, i64 13, !290, i64 13, !290, i64 13, !290, i64 13, !290, i64 13, !290, i64 13, !290, i64 14, !290, i64 16, !290, i64 18}
!414 = !DILocation(line: 80, column: 10, scope: !216, inlinedAt: !254)
!415 = !DILocation(line: 80, column: 14, scope: !216, inlinedAt: !254)
!416 = !DILocation(line: 80, column: 5, scope: !217, inlinedAt: !254)
!417 = !DILocation(line: 83, column: 3, scope: !215, inlinedAt: !254)
!418 = !DILocation(line: 86, column: 10, scope: !249, inlinedAt: !254)
!419 = !DILocation(line: 84, column: 2, scope: !215, inlinedAt: !254)
!420 = !DILocation(line: 86, column: 14, scope: !249, inlinedAt: !254)
!421 = !DILocation(line: 86, column: 5, scope: !217, inlinedAt: !254)
!422 = !DILocation(line: 89, column: 3, scope: !248, inlinedAt: !254)
!423 = !DILocation(line: 91, column: 2, scope: !248, inlinedAt: !254)
!424 = !DILocation(line: 50, column: 45, scope: !186, inlinedAt: !208)
!425 = !DILocation(line: 50, column: 57, scope: !186, inlinedAt: !208)
!426 = !DILocation(line: 50, column: 68, scope: !186, inlinedAt: !208)
!427 = !DILocation(line: 51, column: 24, scope: !186, inlinedAt: !208)
