; ModuleID = 'xdp_prog_kern_port.c'
source_filename = "xdp_prog_kern_port.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.scan = type { i32, i32, [4 x i32], [4 x i32], i32, i32, i32, i32, i64, i64, i8 }

@port_map = global %struct.bpf_map_def { i32 2, i32 4, i32 80, i32 10000, i32 0 }, section "maps", align 4, !dbg !0
@process_packet.____fmt = private unnamed_addr constant [10 x i8] c"XDP_PORT\0A\00", align 1
@process_packet.____fmt.1 = private unnamed_addr constant [21 x i8] c"Hash: %d - key: %d \0A\00", align 1
@process_packet.____fmt.2 = private unnamed_addr constant [24 x i8] c"First time entry used \0A\00", align 1
@process_packet.____fmt.3 = private unnamed_addr constant [26 x i8] c"Updating existing entry \0A\00", align 1
@process_packet.____fmt.4 = private unnamed_addr constant [18 x i8] c"Reuse old entry \0A\00", align 1
@process_packet.____fmt.5 = private unnamed_addr constant [15 x i8] c"Flow ignored \0A\00", align 1
@_license = global [4 x i8] c"GPL\00", section "license", align 1, !dbg !49
@parse_tcp.____fmt = private unnamed_addr constant [14 x i8] c"tcp syn: %d \0A\00", align 1
@parse_tcp.____fmt.6 = private unnamed_addr constant [6 x i8] c"next\0A\00", align 1
@parse_udp.____fmt = private unnamed_addr constant [30 x i8] c"Increment udp empty counter \0A\00", align 1

!1 = distinct !DIGlobalVariable(name: "port_map", scope: !2, file: !3, line: 28, type: !80, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.1-svn334776-1~exp1~20190309042730.123 (branches/release_60)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !42, globals: !48)
!3 = !DIFile(filename: "xdp_prog_kern_port.c", directory: "/home/francois/Documents/ULG/TravailFinEtude/github/TFE/XDP-Code/port-scan-stats")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 876, size: 32, elements: !7)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "/home/francois/Documents/ULG/TravailFinEtude/github/TFE/XDP-Code/port-scan-stats")
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!9 = !DIEnumerator(name: "XDP_DROP", value: 1)
!10 = !DIEnumerator(name: "XDP_PASS", value: 2)
!11 = !DIEnumerator(name: "XDP_TX", value: 3)
!12 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 28, size: 32, elements: !15)
!14 = !DIFile(filename: "/usr/include/linux/in.h", directory: "/home/francois/Documents/ULG/TravailFinEtude/github/TFE/XDP-Code/port-scan-stats")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!16 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!17 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!18 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!19 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!20 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!21 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!22 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!23 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!24 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!25 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!26 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!27 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!28 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!29 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!30 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!31 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!32 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!33 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!34 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!35 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!36 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!37 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!38 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!39 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!40 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!41 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!42 = !{!43, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !46, line: 24, baseType: !47)
!46 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/francois/Documents/ULG/TravailFinEtude/github/TFE/XDP-Code/port-scan-stats")
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !{!0, !49, !55, !66, !73}
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 275, type: !51, isLocal: false, isDefinition: true)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 32, elements: !53)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!53 = !{!54}
!54 = !DISubrange(count: 4)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !57, line: 152, type: !58, isLocal: true, isDefinition: true)
!57 = !DIFile(filename: "../dependencies/libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/francois/Documents/ULG/TravailFinEtude/github/TFE/XDP-Code/port-scan-stats")
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !62, !64, null}
!61 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !46, line: 27, baseType: !65)
!65 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !57, line: 33, type: !68, isLocal: true, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!43, !43, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !57, line: 89, type: !75, isLocal: true, isDefinition: true)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !46, line: 31, baseType: !79)
!79 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !81, line: 33, size: 160, elements: !82)
!81 = !DIFile(filename: "../dependencies/libbpf/src//build/usr/include/bpf/bpf_helpers.h", directory: "/home/francois/Documents/ULG/TravailFinEtude/github/TFE/XDP-Code/port-scan-stats")
!82 = !{!83, !84, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !81, line: 34, baseType: !65, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !80, file: !81, line: 35, baseType: !65, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !80, file: !81, line: 36, baseType: !65, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !80, file: !81, line: 37, baseType: !65, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !80, file: !81, line: 38, baseType: !65, size: 32, offset: 128)
!88 = !{i32 2, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{i32 1, !"wchar_size", i32 4}
!91 = !{!"clang version 6.0.1-svn334776-1~exp1~20190309042730.123 (branches/release_60)"}
!92 = distinct !DISubprogram(name: "process_packet", scope: !3, file: !3, line: 129, type: !93, isLocal: false, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !101)
!93 = !DISubroutineType(types: !94)
!94 = !{!61, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 887, size: 96, elements: !97)
!97 = !{!98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !6, line: 888, baseType: !64, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !96, file: !6, line: 889, baseType: !64, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !96, file: !6, line: 890, baseType: !64, size: 32, offset: 64)
!101 = !{!102, !103, !104, !105, !124, !137, !138, !140, !141, !142, !143, !144, !145, !146, !151, !158, !165, !173, !181}
!102 = !DILocalVariable(name: "ctx", arg: 1, scope: !92, file: !3, line: 129, type: !95)
!103 = !DILocalVariable(name: "data_end", scope: !92, file: !3, line: 131, type: !43)
!104 = !DILocalVariable(name: "data", scope: !92, file: !3, line: 132, type: !43)
!105 = !DILocalVariable(name: "v", scope: !92, file: !3, line: 133, type: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "scan", file: !108, line: 10, size: 640, elements: !109)
!108 = !DIFile(filename: "./common_kern_user.h", directory: "/home/francois/Documents/ULG/TravailFinEtude/github/TFE/XDP-Code/port-scan-stats")
!109 = !{!110, !111, !112, !114, !115, !116, !117, !118, !119, !120, !121}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !107, file: !108, line: 11, baseType: !64, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !107, file: !108, line: 12, baseType: !64, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "srcv6", scope: !107, file: !108, line: 13, baseType: !113, size: 128, offset: 64)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !53)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !107, file: !108, line: 14, baseType: !113, size: 128, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "dstport", scope: !107, file: !108, line: 15, baseType: !64, size: 32, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "csyn", scope: !107, file: !108, line: 16, baseType: !64, size: 32, offset: 352)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "crst", scope: !107, file: !108, line: 17, baseType: !64, size: 32, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "empty_udp", scope: !107, file: !108, line: 18, baseType: !64, size: 32, offset: 416)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_start", scope: !107, file: !108, line: 19, baseType: !78, size: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_last_m", scope: !107, file: !108, line: 20, baseType: !78, size: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !107, file: !108, line: 21, baseType: !122, size: 8, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !46, line: 21, baseType: !123)
!123 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DILocalVariable(name: "eth", scope: !92, file: !3, line: 134, type: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !127, line: 159, size: 112, elements: !128)
!127 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "/home/francois/Documents/ULG/TravailFinEtude/github/TFE/XDP-Code/port-scan-stats")
!128 = !{!129, !133, !134}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !126, file: !127, line: 160, baseType: !130, size: 48)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 48, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 6)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !126, file: !127, line: 161, baseType: !130, size: 48, offset: 48)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !126, file: !127, line: 162, baseType: !135, size: 16, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !136, line: 25, baseType: !45)
!136 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/francois/Documents/ULG/TravailFinEtude/github/TFE/XDP-Code/port-scan-stats")
!137 = !DILocalVariable(name: "f", scope: !92, file: !3, line: 135, type: !107)
!138 = !DILocalVariable(name: "use_encap", scope: !92, file: !3, line: 136, type: !139)
!139 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!140 = !DILocalVariable(name: "is_ip6", scope: !92, file: !3, line: 137, type: !139)
!141 = !DILocalVariable(name: "jhash", scope: !92, file: !3, line: 138, type: !139)
!142 = !DILocalVariable(name: "eth_proto", scope: !92, file: !3, line: 139, type: !64)
!143 = !DILocalVariable(name: "hash", scope: !92, file: !3, line: 140, type: !64)
!144 = !DILocalVariable(name: "key", scope: !92, file: !3, line: 141, type: !64)
!145 = !DILocalVariable(name: "off", scope: !92, file: !3, line: 142, type: !64)
!146 = !DILocalVariable(name: "____fmt", scope: !147, file: !3, line: 143, type: !148)
!147 = distinct !DILexicalBlock(scope: !92, file: !3, line: 143, column: 2)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 80, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 10)
!151 = !DILocalVariable(name: "____fmt", scope: !152, file: !3, line: 204, type: !155)
!152 = distinct !DILexicalBlock(scope: !153, file: !3, line: 204, column: 9)
!153 = distinct !DILexicalBlock(scope: !154, file: !3, line: 200, column: 13)
!154 = distinct !DILexicalBlock(scope: !92, file: !3, line: 200, column: 6)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 168, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 21)
!158 = !DILocalVariable(name: "____fmt", scope: !159, file: !3, line: 215, type: !162)
!159 = distinct !DILexicalBlock(scope: !160, file: !3, line: 215, column: 9)
!160 = distinct !DILexicalBlock(scope: !161, file: !3, line: 214, column: 2)
!161 = distinct !DILexicalBlock(scope: !92, file: !3, line: 213, column: 7)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 192, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 24)
!165 = !DILocalVariable(name: "____fmt", scope: !166, file: !3, line: 233, type: !170)
!166 = distinct !DILexicalBlock(scope: !167, file: !3, line: 233, column: 4)
!167 = distinct !DILexicalBlock(scope: !168, file: !3, line: 231, column: 3)
!168 = distinct !DILexicalBlock(scope: !169, file: !3, line: 230, column: 6)
!169 = distinct !DILexicalBlock(scope: !161, file: !3, line: 229, column: 2)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 208, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 26)
!173 = !DILocalVariable(name: "____fmt", scope: !174, file: !3, line: 245, type: !178)
!174 = distinct !DILexicalBlock(scope: !175, file: !3, line: 245, column: 5)
!175 = distinct !DILexicalBlock(scope: !176, file: !3, line: 243, column: 4)
!176 = distinct !DILexicalBlock(scope: !177, file: !3, line: 242, column: 7)
!177 = distinct !DILexicalBlock(scope: !168, file: !3, line: 240, column: 3)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 144, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 18)
!181 = !DILocalVariable(name: "____fmt", scope: !182, file: !3, line: 262, type: !184)
!182 = distinct !DILexicalBlock(scope: !183, file: !3, line: 262, column: 5)
!183 = distinct !DILexicalBlock(scope: !176, file: !3, line: 261, column: 4)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 120, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 15)
!187 = !DILocalVariable(name: "____fmt", scope: !188, file: !3, line: 63, type: !209)
!188 = distinct !DILexicalBlock(scope: !189, file: !3, line: 63, column: 3)
!189 = distinct !DILexicalBlock(scope: !190, file: !3, line: 61, column: 2)
!190 = distinct !DILexicalBlock(scope: !191, file: !3, line: 60, column: 5)
!191 = distinct !DISubprogram(name: "parse_udp", scope: !3, file: !3, line: 50, type: !192, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !194)
!192 = !DISubroutineType(types: !193)
!193 = !{!139, !43, !78, !43, !106}
!194 = !{!195, !196, !197, !198, !199, !187}
!195 = !DILocalVariable(name: "data", arg: 1, scope: !191, file: !3, line: 50, type: !43)
!196 = !DILocalVariable(name: "off", arg: 2, scope: !191, file: !3, line: 50, type: !78)
!197 = !DILocalVariable(name: "data_end", arg: 3, scope: !191, file: !3, line: 50, type: !43)
!198 = !DILocalVariable(name: "f", arg: 4, scope: !191, file: !3, line: 51, type: !106)
!199 = !DILocalVariable(name: "udp", scope: !191, file: !3, line: 53, type: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !202, line: 23, size: 64, elements: !203)
!202 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "/home/francois/Documents/ULG/TravailFinEtude/github/TFE/XDP-Code/port-scan-stats")
!203 = !{!204, !205, !206, !207}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !201, file: !202, line: 24, baseType: !135, size: 16)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !201, file: !202, line: 25, baseType: !135, size: 16, offset: 16)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !201, file: !202, line: 26, baseType: !135, size: 16, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !201, file: !202, line: 27, baseType: !208, size: 16, offset: 48)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !136, line: 31, baseType: !45)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 240, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 30)
!212 = !DILocation(line: 63, column: 3, scope: !188, inlinedAt: !213)
!213 = distinct !DILocation(line: 194, column: 8, scope: !214)
!214 = distinct !DILexicalBlock(scope: !215, file: !3, line: 194, column: 7)
!215 = distinct !DILexicalBlock(scope: !216, file: !3, line: 193, column: 40)
!216 = distinct !DILexicalBlock(scope: !217, file: !3, line: 193, column: 13)
!217 = distinct !DILexicalBlock(scope: !92, file: !3, line: 190, column: 6)
!218 = !DILocalVariable(name: "____fmt", scope: !219, file: !3, line: 83, type: !254)
!219 = distinct !DILexicalBlock(scope: !220, file: !3, line: 83, column: 3)
!220 = distinct !DILexicalBlock(scope: !221, file: !3, line: 81, column: 2)
!221 = distinct !DILexicalBlock(scope: !222, file: !3, line: 80, column: 5)
!222 = distinct !DISubprogram(name: "parse_tcp", scope: !3, file: !3, line: 70, type: !192, isLocal: true, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !223)
!223 = !{!224, !225, !226, !227, !228, !218, !251}
!224 = !DILocalVariable(name: "data", arg: 1, scope: !222, file: !3, line: 70, type: !43)
!225 = !DILocalVariable(name: "off", arg: 2, scope: !222, file: !3, line: 70, type: !78)
!226 = !DILocalVariable(name: "data_end", arg: 3, scope: !222, file: !3, line: 70, type: !43)
!227 = !DILocalVariable(name: "f", arg: 4, scope: !222, file: !3, line: 71, type: !106)
!228 = !DILocalVariable(name: "tcp", scope: !222, file: !3, line: 73, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !231, line: 25, size: 160, elements: !232)
!231 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "/home/francois/Documents/ULG/TravailFinEtude/github/TFE/XDP-Code/port-scan-stats")
!232 = !{!233, !234, !235, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !230, file: !231, line: 26, baseType: !135, size: 16)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !230, file: !231, line: 27, baseType: !135, size: 16, offset: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !230, file: !231, line: 28, baseType: !236, size: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !136, line: 27, baseType: !64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !230, file: !231, line: 29, baseType: !236, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !230, file: !231, line: 31, baseType: !45, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !230, file: !231, line: 32, baseType: !45, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !230, file: !231, line: 33, baseType: !45, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !230, file: !231, line: 34, baseType: !45, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !230, file: !231, line: 35, baseType: !45, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !230, file: !231, line: 36, baseType: !45, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !230, file: !231, line: 37, baseType: !45, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !230, file: !231, line: 38, baseType: !45, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !230, file: !231, line: 39, baseType: !45, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !230, file: !231, line: 40, baseType: !45, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !230, file: !231, line: 55, baseType: !135, size: 16, offset: 112)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !230, file: !231, line: 56, baseType: !208, size: 16, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !230, file: !231, line: 57, baseType: !135, size: 16, offset: 144)
!251 = !DILocalVariable(name: "____fmt", scope: !252, file: !3, line: 88, type: !253)
!252 = distinct !DILexicalBlock(scope: !222, file: !3, line: 88, column: 2)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 48, elements: !131)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 112, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 14)
!257 = !DILocation(line: 83, column: 3, scope: !219, inlinedAt: !258)
!258 = distinct !DILocation(line: 191, column: 8, scope: !259)
!259 = distinct !DILexicalBlock(scope: !260, file: !3, line: 191, column: 7)
!260 = distinct !DILexicalBlock(scope: !217, file: !3, line: 190, column: 33)
!261 = !DILocation(line: 88, column: 2, scope: !252, inlinedAt: !258)
!262 = !DILocation(line: 129, column: 35, scope: !92)
!263 = !DILocation(line: 131, column: 38, scope: !92)
!264 = !{!265, !266, i64 4}
!265 = !{!"xdp_md", !266, i64 0, !266, i64 4, !266, i64 8}
!266 = !{!"int", !267, i64 0}
!267 = !{!"omnipotent char", !268, i64 0}
!268 = !{!"Simple C/C++ TBAA"}
!269 = !DILocation(line: 131, column: 27, scope: !92)
!270 = !DILocation(line: 131, column: 19, scope: !92)
!271 = !DILocation(line: 131, column: 8, scope: !92)
!272 = !DILocation(line: 132, column: 34, scope: !92)
!273 = !{!265, !266, i64 0}
!274 = !DILocation(line: 132, column: 23, scope: !92)
!275 = !DILocation(line: 132, column: 15, scope: !92)
!276 = !DILocation(line: 132, column: 8, scope: !92)
!277 = !DILocation(line: 134, column: 17, scope: !92)
!278 = !DILocation(line: 136, column: 7, scope: !92)
!279 = !DILocation(line: 137, column: 7, scope: !92)
!280 = !DILocation(line: 138, column: 7, scope: !92)
!281 = !DILocation(line: 141, column: 2, scope: !92)
!282 = !DILocation(line: 143, column: 2, scope: !147)
!283 = !DILocation(line: 143, column: 2, scope: !92)
!284 = !DILocation(line: 141, column: 8, scope: !92)
!285 = !DILocation(line: 145, column: 6, scope: !92)
!286 = !{!266, !266, i64 0}
!287 = !DILocation(line: 142, column: 8, scope: !92)
!288 = !DILocation(line: 150, column: 11, scope: !289)
!289 = distinct !DILexicalBlock(scope: !92, file: !3, line: 150, column: 6)
!290 = !DILocation(line: 150, column: 17, scope: !289)
!291 = !DILocation(line: 150, column: 6, scope: !92)
!292 = !DILocation(line: 134, column: 23, scope: !92)
!293 = !DILocation(line: 153, column: 19, scope: !92)
!294 = !{!295, !296, i64 12}
!295 = !{!"ethhdr", !267, i64 0, !267, i64 6, !296, i64 12}
!296 = !{!"short", !267, i64 0}
!297 = !DILocation(line: 155, column: 6, scope: !92)
!298 = !DILocation(line: 135, column: 14, scope: !92)
!299 = !DILocalVariable(name: "off", arg: 2, scope: !300, file: !3, line: 92, type: !78)
!300 = distinct !DISubprogram(name: "parse_ip4", scope: !3, file: !3, line: 92, type: !192, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !301)
!301 = !{!302, !299, !303, !304, !305}
!302 = !DILocalVariable(name: "data", arg: 1, scope: !300, file: !3, line: 92, type: !43)
!303 = !DILocalVariable(name: "data_end", arg: 3, scope: !300, file: !3, line: 92, type: !43)
!304 = !DILocalVariable(name: "f", arg: 4, scope: !300, file: !3, line: 93, type: !106)
!305 = !DILocalVariable(name: "iph", scope: !300, file: !3, line: 95, type: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !308, line: 86, size: 160, elements: !309)
!308 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "/home/francois/Documents/ULG/TravailFinEtude/github/TFE/XDP-Code/port-scan-stats")
!309 = !{!310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !307, file: !308, line: 88, baseType: !122, size: 4, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !307, file: !308, line: 89, baseType: !122, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !307, file: !308, line: 96, baseType: !122, size: 8, offset: 8)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !307, file: !308, line: 97, baseType: !135, size: 16, offset: 16)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !307, file: !308, line: 98, baseType: !135, size: 16, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !307, file: !308, line: 99, baseType: !135, size: 16, offset: 48)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !307, file: !308, line: 100, baseType: !122, size: 8, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !307, file: !308, line: 101, baseType: !122, size: 8, offset: 72)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !307, file: !308, line: 102, baseType: !208, size: 16, offset: 80)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !307, file: !308, line: 103, baseType: !236, size: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !307, file: !308, line: 104, baseType: !236, size: 32, offset: 128)
!321 = !DILocation(line: 92, column: 57, scope: !300, inlinedAt: !322)
!322 = distinct !DILocation(line: 156, column: 8, scope: !323)
!323 = distinct !DILexicalBlock(scope: !324, file: !3, line: 156, column: 7)
!324 = distinct !DILexicalBlock(scope: !325, file: !3, line: 155, column: 40)
!325 = distinct !DILexicalBlock(scope: !92, file: !3, line: 155, column: 6)
!326 = !DILocation(line: 98, column: 10, scope: !327, inlinedAt: !322)
!327 = distinct !DILexicalBlock(scope: !300, file: !3, line: 98, column: 6)
!328 = !DILocation(line: 98, column: 14, scope: !327, inlinedAt: !322)
!329 = !DILocation(line: 98, column: 6, scope: !300, inlinedAt: !322)
!330 = !DILocation(line: 101, column: 11, scope: !331, inlinedAt: !322)
!331 = distinct !DILexicalBlock(scope: !300, file: !3, line: 101, column: 6)
!332 = !DILocation(line: 101, column: 15, scope: !331, inlinedAt: !322)
!333 = !DILocation(line: 101, column: 6, scope: !300, inlinedAt: !322)
!334 = !DILocation(line: 104, column: 16, scope: !300, inlinedAt: !322)
!335 = !{!336, !266, i64 12}
!336 = !{!"iphdr", !267, i64 0, !267, i64 0, !267, i64 1, !296, i64 2, !296, i64 4, !296, i64 6, !267, i64 8, !267, i64 9, !296, i64 10, !266, i64 12, !266, i64 16}
!337 = !DILocation(line: 105, column: 16, scope: !300, inlinedAt: !322)
!338 = !{!336, !266, i64 16}
!339 = !DILocation(line: 106, column: 21, scope: !300, inlinedAt: !322)
!340 = !DILocation(line: 156, column: 7, scope: !324)
!341 = !DILocalVariable(name: "off", arg: 2, scope: !342, file: !3, line: 111, type: !78)
!342 = distinct !DISubprogram(name: "parse_ip6", scope: !3, file: !3, line: 111, type: !192, isLocal: true, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !343)
!343 = !{!344, !341, !345, !346, !347}
!344 = !DILocalVariable(name: "data", arg: 1, scope: !342, file: !3, line: 111, type: !43)
!345 = !DILocalVariable(name: "data_end", arg: 3, scope: !342, file: !3, line: 111, type: !43)
!346 = !DILocalVariable(name: "f", arg: 4, scope: !342, file: !3, line: 112, type: !106)
!347 = !DILocalVariable(name: "ip6h", scope: !342, file: !3, line: 114, type: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !350, line: 116, size: 320, elements: !351)
!350 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "/home/francois/Documents/ULG/TravailFinEtude/github/TFE/XDP-Code/port-scan-stats")
!351 = !{!352, !353, !354, !358, !359, !360, !361, !378}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !349, file: !350, line: 118, baseType: !122, size: 4, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !349, file: !350, line: 119, baseType: !122, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !349, file: !350, line: 126, baseType: !355, size: 24, offset: 8)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 24, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 3)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !349, file: !350, line: 128, baseType: !135, size: 16, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !349, file: !350, line: 129, baseType: !122, size: 8, offset: 48)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !349, file: !350, line: 130, baseType: !122, size: 8, offset: 56)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !349, file: !350, line: 132, baseType: !362, size: 128, offset: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !363, line: 33, size: 128, elements: !364)
!363 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "/home/francois/Documents/ULG/TravailFinEtude/github/TFE/XDP-Code/port-scan-stats")
!364 = !{!365}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !362, file: !363, line: 40, baseType: !366, size: 128)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !362, file: !363, line: 34, size: 128, elements: !367)
!367 = !{!368, !372, !376}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !366, file: !363, line: 35, baseType: !369, size: 128)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 128, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 16)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !366, file: !363, line: 37, baseType: !373, size: 128)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 128, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 8)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !366, file: !363, line: 38, baseType: !377, size: 128)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 128, elements: !53)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !349, file: !350, line: 133, baseType: !362, size: 128, offset: 192)
!379 = !DILocation(line: 111, column: 57, scope: !342, inlinedAt: !380)
!380 = distinct !DILocation(line: 160, column: 8, scope: !381)
!381 = distinct !DILexicalBlock(scope: !382, file: !3, line: 160, column: 7)
!382 = distinct !DILexicalBlock(scope: !383, file: !3, line: 159, column: 49)
!383 = distinct !DILexicalBlock(scope: !325, file: !3, line: 159, column: 13)
!384 = !DILocation(line: 114, column: 18, scope: !342, inlinedAt: !380)
!385 = !DILocation(line: 117, column: 11, scope: !386, inlinedAt: !380)
!386 = distinct !DILexicalBlock(scope: !342, file: !3, line: 117, column: 6)
!387 = !DILocation(line: 117, column: 15, scope: !386, inlinedAt: !380)
!388 = !DILocation(line: 117, column: 6, scope: !342, inlinedAt: !380)
!389 = !DILocation(line: 120, column: 2, scope: !342, inlinedAt: !380)
!390 = !DILocation(line: 121, column: 2, scope: !342, inlinedAt: !380)
!391 = !DILocation(line: 122, column: 22, scope: !342, inlinedAt: !380)
!392 = !DILocation(line: 160, column: 7, scope: !382)
!393 = !{!267, !267, i64 0}
!394 = !DILocation(line: 169, column: 6, scope: !92)
!395 = !DILocation(line: 175, column: 7, scope: !396)
!396 = distinct !DILexicalBlock(scope: !397, file: !3, line: 169, column: 34)
!397 = distinct !DILexicalBlock(scope: !92, file: !3, line: 169, column: 6)
!398 = !DILocation(line: 176, column: 2, scope: !396)
!399 = !DILocation(line: 182, column: 7, scope: !400)
!400 = distinct !DILexicalBlock(scope: !401, file: !3, line: 176, column: 41)
!401 = distinct !DILexicalBlock(scope: !397, file: !3, line: 176, column: 13)
!402 = !DILocation(line: 183, column: 2, scope: !400)
!403 = !DILocation(line: 185, column: 11, scope: !404)
!404 = distinct !DILexicalBlock(scope: !92, file: !3, line: 185, column: 6)
!405 = !DILocation(line: 185, column: 17, scope: !404)
!406 = !DILocation(line: 185, column: 6, scope: !92)
!407 = !DILocation(line: 190, column: 6, scope: !92)
!408 = !DILocation(line: 70, column: 45, scope: !222, inlinedAt: !258)
!409 = !DILocation(line: 70, column: 57, scope: !222, inlinedAt: !258)
!410 = !DILocation(line: 70, column: 68, scope: !222, inlinedAt: !258)
!411 = !DILocation(line: 71, column: 24, scope: !222, inlinedAt: !258)
!412 = !DILocation(line: 73, column: 17, scope: !222, inlinedAt: !258)
!413 = !DILocation(line: 76, column: 10, scope: !414, inlinedAt: !258)
!414 = distinct !DILexicalBlock(scope: !222, file: !3, line: 76, column: 6)
!415 = !DILocation(line: 76, column: 14, scope: !414, inlinedAt: !258)
!416 = !DILocation(line: 76, column: 6, scope: !222, inlinedAt: !258)
!417 = !DILocation(line: 79, column: 14, scope: !222, inlinedAt: !258)
!418 = !{!419, !296, i64 2}
!419 = !{!"tcphdr", !296, i64 0, !296, i64 2, !266, i64 4, !266, i64 8, !296, i64 12, !296, i64 12, !296, i64 13, !296, i64 13, !296, i64 13, !296, i64 13, !296, i64 13, !296, i64 13, !296, i64 13, !296, i64 13, !296, i64 14, !296, i64 16, !296, i64 18}
!420 = !DILocation(line: 80, column: 10, scope: !221, inlinedAt: !258)
!421 = !DILocation(line: 80, column: 14, scope: !221, inlinedAt: !258)
!422 = !DILocation(line: 80, column: 5, scope: !222, inlinedAt: !258)
!423 = !DILocation(line: 83, column: 3, scope: !220, inlinedAt: !258)
!424 = !DILocation(line: 84, column: 2, scope: !220, inlinedAt: !258)
!425 = !DILocation(line: 88, column: 2, scope: !222, inlinedAt: !258)
!426 = !DILocation(line: 191, column: 7, scope: !260)
!427 = !DILocation(line: 50, column: 45, scope: !191, inlinedAt: !213)
!428 = !DILocation(line: 50, column: 57, scope: !191, inlinedAt: !213)
!429 = !DILocation(line: 50, column: 68, scope: !191, inlinedAt: !213)
!430 = !DILocation(line: 51, column: 24, scope: !191, inlinedAt: !213)
!431 = !DILocation(line: 53, column: 17, scope: !191, inlinedAt: !213)
!432 = !DILocation(line: 56, column: 10, scope: !433, inlinedAt: !213)
!433 = distinct !DILexicalBlock(scope: !191, file: !3, line: 56, column: 6)
