; ModuleID = 'xdp_prog_kern_flow.c'
source_filename = "xdp_prog_kern_flow.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.flow_meta = type { i32, i32, [4 x i32], [4 x i32], i32, [2 x i16], i8, i32, i64, i64, i64 }

@flow_map = global %struct.bpf_map_def { i32 2, i32 4, i32 80, i32 200000, i32 0 }, section "maps", align 4, !dbg !0
@process_packet.____fmt = private unnamed_addr constant [11 x i8] c"Advanced \0A\00", align 1
@process_packet.____fmt.1 = private unnamed_addr constant [16 x i8] c"Init new flow \0A\00", align 1
@process_packet.____fmt.2 = private unnamed_addr constant [35 x i8] c"Last flow modification time: %ld \0A\00", align 1
@process_packet.____fmt.3 = private unnamed_addr constant [16 x i8] c"Updating flow \0A\00", align 1
@process_packet.____fmt.4 = private unnamed_addr constant [18 x i8] c"Reuse old entry \0A\00", align 1
@process_packet.____fmt.5 = private unnamed_addr constant [15 x i8] c"Flow ignored \0A\00", align 1
@process_packet.____fmt.6 = private unnamed_addr constant [31 x i8] c"Count for key:%d , count: %d \0A\00", align 1
@process_packet.____fmt.7 = private unnamed_addr constant [35 x i8] c"Size for key:%d , size: %d bytes \0A\00", align 1
@process_packet.____fmt.8 = private unnamed_addr constant [15 x i8] c"Ports: %u %u \0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "flow_map", scope: !2, file: !3, line: 28, type: !80, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !42, globals: !50)
!3 = !DIFile(filename: "xdp_prog_kern_flow.c", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 876, size: 32, elements: !7)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!9 = !DIEnumerator(name: "XDP_DROP", value: 1)
!10 = !DIEnumerator(name: "XDP_PASS", value: 2)
!11 = !DIEnumerator(name: "XDP_TX", value: 3)
!12 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 28, size: 32, elements: !15)
!14 = !DIFile(filename: "/usr/include/linux/in.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!16 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!17 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!18 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!19 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!20 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!21 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!22 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!23 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!24 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!25 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!26 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!27 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!28 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!29 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!30 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!31 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!32 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!33 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!34 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!35 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!36 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!37 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!38 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!39 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!40 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!41 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!42 = !{!43, !44, !45, !48}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !46, line: 24, baseType: !47)
!46 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !46, line: 27, baseType: !49)
!49 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!50 = !{!0, !51, !57, !66, !73}
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 261, type: !53, isLocal: false, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 32, elements: !55)
!54 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!55 = !{!56}
!56 = !DISubrange(count: 4)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !59, line: 152, type: !60, isLocal: true, isDefinition: true)
!59 = !DIFile(filename: "../dependencies/libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !64, !48, null}
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !59, line: 33, type: !68, isLocal: true, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!43, !43, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !59, line: 89, type: !75, isLocal: true, isDefinition: true)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !46, line: 31, baseType: !79)
!79 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !81, line: 33, size: 160, elements: !82)
!81 = !DIFile(filename: "../dependencies/libbpf/src//build/usr/include/bpf/bpf_helpers.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!82 = !{!83, !84, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !81, line: 34, baseType: !49, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !80, file: !81, line: 35, baseType: !49, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !80, file: !81, line: 36, baseType: !49, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !80, file: !81, line: 37, baseType: !49, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !80, file: !81, line: 38, baseType: !49, size: 32, offset: 128)
!88 = !{i32 2, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{i32 1, !"wchar_size", i32 4}
!91 = !{!"clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)"}
!92 = distinct !DISubprogram(name: "process_packet", scope: !3, file: !3, line: 117, type: !93, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !101)
!93 = !DISubroutineType(types: !94)
!94 = !{!63, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 887, size: 96, elements: !97)
!97 = !{!98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !6, line: 888, baseType: !48, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !96, file: !6, line: 889, baseType: !48, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !96, file: !6, line: 890, baseType: !48, size: 32, offset: 64)
!101 = !{!102, !103, !104, !105, !127, !140, !141, !143, !144, !145, !146, !147, !148, !149, !154, !161, !166, !171, !179, !185, !190, !192}
!102 = !DILocalVariable(name: "ctx", arg: 1, scope: !92, file: !3, line: 117, type: !95)
!103 = !DILocalVariable(name: "data_end", scope: !92, file: !3, line: 119, type: !43)
!104 = !DILocalVariable(name: "data", scope: !92, file: !3, line: 120, type: !43)
!105 = !DILocalVariable(name: "v", scope: !92, file: !3, line: 121, type: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_meta", file: !108, line: 10, size: 640, elements: !109)
!108 = !DIFile(filename: "./common_kern_user.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!109 = !{!110, !111, !112, !114, !115, !116, !120, !123, !124, !125, !126}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !107, file: !108, line: 11, baseType: !48, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !107, file: !108, line: 12, baseType: !48, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "srcv6", scope: !107, file: !108, line: 13, baseType: !113, size: 128, offset: 64)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 128, elements: !55)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !107, file: !108, line: 14, baseType: !113, size: 128, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ports", scope: !107, file: !108, line: 15, baseType: !48, size: 32, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "port16", scope: !107, file: !108, line: 16, baseType: !117, size: 32, offset: 352)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 32, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 2)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !107, file: !108, line: 17, baseType: !121, size: 8, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !46, line: 21, baseType: !122)
!122 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !107, file: !108, line: 18, baseType: !48, size: 32, offset: 416)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !107, file: !108, line: 19, baseType: !78, size: 64, offset: 448)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_start", scope: !107, file: !108, line: 20, baseType: !78, size: 64, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_last_m", scope: !107, file: !108, line: 21, baseType: !78, size: 64, offset: 576)
!127 = !DILocalVariable(name: "eth", scope: !92, file: !3, line: 122, type: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !130, line: 159, size: 112, elements: !131)
!130 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!131 = !{!132, !136, !137}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !129, file: !130, line: 160, baseType: !133, size: 48)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 48, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 6)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !129, file: !130, line: 161, baseType: !133, size: 48, offset: 48)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !129, file: !130, line: 162, baseType: !138, size: 16, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !139, line: 25, baseType: !45)
!139 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!140 = !DILocalVariable(name: "f", scope: !92, file: !3, line: 123, type: !107)
!141 = !DILocalVariable(name: "use_encap", scope: !92, file: !3, line: 124, type: !142)
!142 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!143 = !DILocalVariable(name: "is_ip6", scope: !92, file: !3, line: 125, type: !142)
!144 = !DILocalVariable(name: "jhash", scope: !92, file: !3, line: 126, type: !142)
!145 = !DILocalVariable(name: "eth_proto", scope: !92, file: !3, line: 127, type: !48)
!146 = !DILocalVariable(name: "hash", scope: !92, file: !3, line: 128, type: !48)
!147 = !DILocalVariable(name: "key", scope: !92, file: !3, line: 129, type: !48)
!148 = !DILocalVariable(name: "off", scope: !92, file: !3, line: 130, type: !48)
!149 = !DILocalVariable(name: "____fmt", scope: !150, file: !3, line: 131, type: !151)
!150 = distinct !DILexicalBlock(scope: !92, file: !3, line: 131, column: 2)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 88, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 11)
!154 = !DILocalVariable(name: "____fmt", scope: !155, file: !3, line: 205, type: !158)
!155 = distinct !DILexicalBlock(scope: !156, file: !3, line: 205, column: 9)
!156 = distinct !DILexicalBlock(scope: !157, file: !3, line: 204, column: 2)
!157 = distinct !DILexicalBlock(scope: !92, file: !3, line: 203, column: 7)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 128, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 16)
!161 = !DILocalVariable(name: "____fmt", scope: !162, file: !3, line: 214, type: !163)
!162 = distinct !DILexicalBlock(scope: !156, file: !3, line: 214, column: 3)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 280, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 35)
!166 = !DILocalVariable(name: "____fmt", scope: !167, file: !3, line: 221, type: !158)
!167 = distinct !DILexicalBlock(scope: !168, file: !3, line: 221, column: 4)
!168 = distinct !DILexicalBlock(scope: !169, file: !3, line: 219, column: 3)
!169 = distinct !DILexicalBlock(scope: !170, file: !3, line: 218, column: 6)
!170 = distinct !DILexicalBlock(scope: !157, file: !3, line: 217, column: 2)
!171 = !DILocalVariable(name: "____fmt", scope: !172, file: !3, line: 232, type: !176)
!172 = distinct !DILexicalBlock(scope: !173, file: !3, line: 232, column: 5)
!173 = distinct !DILexicalBlock(scope: !174, file: !3, line: 230, column: 4)
!174 = distinct !DILexicalBlock(scope: !175, file: !3, line: 229, column: 7)
!175 = distinct !DILexicalBlock(scope: !169, file: !3, line: 227, column: 3)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 144, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 18)
!179 = !DILocalVariable(name: "____fmt", scope: !180, file: !3, line: 247, type: !182)
!180 = distinct !DILexicalBlock(scope: !181, file: !3, line: 247, column: 5)
!181 = distinct !DILexicalBlock(scope: !174, file: !3, line: 246, column: 4)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 120, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 15)
!185 = !DILocalVariable(name: "____fmt", scope: !186, file: !3, line: 252, type: !187)
!186 = distinct !DILexicalBlock(scope: !92, file: !3, line: 252, column: 2)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 248, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 31)
!190 = !DILocalVariable(name: "____fmt", scope: !191, file: !3, line: 253, type: !163)
!191 = distinct !DILexicalBlock(scope: !92, file: !3, line: 253, column: 2)
!192 = !DILocalVariable(name: "____fmt", scope: !193, file: !3, line: 254, type: !182)
!193 = distinct !DILexicalBlock(scope: !92, file: !3, line: 254, column: 5)
!194 = !DILocation(line: 117, column: 35, scope: !92)
!195 = !DILocation(line: 119, column: 38, scope: !92)
!196 = !{!197, !198, i64 4}
!197 = !{!"xdp_md", !198, i64 0, !198, i64 4, !198, i64 8}
!198 = !{!"int", !199, i64 0}
!199 = !{!"omnipotent char", !200, i64 0}
!200 = !{!"Simple C/C++ TBAA"}
!201 = !DILocation(line: 119, column: 27, scope: !92)
!202 = !DILocation(line: 119, column: 19, scope: !92)
!203 = !DILocation(line: 119, column: 8, scope: !92)
!204 = !DILocation(line: 120, column: 34, scope: !92)
!205 = !{!197, !198, i64 0}
!206 = !DILocation(line: 120, column: 23, scope: !92)
!207 = !DILocation(line: 120, column: 15, scope: !92)
!208 = !DILocation(line: 120, column: 8, scope: !92)
!209 = !DILocation(line: 122, column: 17, scope: !92)
!210 = !DILocation(line: 124, column: 7, scope: !92)
!211 = !DILocation(line: 125, column: 7, scope: !92)
!212 = !DILocation(line: 126, column: 7, scope: !92)
!213 = !DILocation(line: 129, column: 2, scope: !92)
!214 = !DILocation(line: 131, column: 2, scope: !150)
!215 = !DILocation(line: 131, column: 2, scope: !92)
!216 = !DILocation(line: 129, column: 8, scope: !92)
!217 = !DILocation(line: 133, column: 6, scope: !92)
!218 = !{!198, !198, i64 0}
!219 = !DILocation(line: 130, column: 8, scope: !92)
!220 = !DILocation(line: 138, column: 11, scope: !221)
!221 = distinct !DILexicalBlock(scope: !92, file: !3, line: 138, column: 6)
!222 = !DILocation(line: 138, column: 17, scope: !221)
!223 = !DILocation(line: 138, column: 6, scope: !92)
!224 = !DILocation(line: 122, column: 23, scope: !92)
!225 = !DILocation(line: 141, column: 19, scope: !92)
!226 = !{!227, !228, i64 12}
!227 = !{!"ethhdr", !199, i64 0, !199, i64 6, !228, i64 12}
!228 = !{!"short", !199, i64 0}
!229 = !DILocation(line: 143, column: 6, scope: !92)
!230 = !DILocation(line: 123, column: 19, scope: !92)
!231 = !DILocalVariable(name: "off", arg: 2, scope: !232, file: !3, line: 80, type: !78)
!232 = distinct !DISubprogram(name: "parse_ip4", scope: !3, file: !3, line: 80, type: !233, isLocal: true, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !235)
!233 = !DISubroutineType(types: !234)
!234 = !{!142, !43, !78, !43, !106}
!235 = !{!236, !231, !237, !238, !239}
!236 = !DILocalVariable(name: "data", arg: 1, scope: !232, file: !3, line: 80, type: !43)
!237 = !DILocalVariable(name: "data_end", arg: 3, scope: !232, file: !3, line: 80, type: !43)
!238 = !DILocalVariable(name: "f", arg: 4, scope: !232, file: !3, line: 81, type: !106)
!239 = !DILocalVariable(name: "iph", scope: !232, file: !3, line: 83, type: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !242, line: 86, size: 160, elements: !243)
!242 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !252, !254, !256}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !241, file: !242, line: 88, baseType: !121, size: 4, flags: DIFlagBitField, extraData: i64 0)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !241, file: !242, line: 89, baseType: !121, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !241, file: !242, line: 96, baseType: !121, size: 8, offset: 8)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !241, file: !242, line: 97, baseType: !138, size: 16, offset: 16)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !241, file: !242, line: 98, baseType: !138, size: 16, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !241, file: !242, line: 99, baseType: !138, size: 16, offset: 48)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !241, file: !242, line: 100, baseType: !121, size: 8, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !241, file: !242, line: 101, baseType: !121, size: 8, offset: 72)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !241, file: !242, line: 102, baseType: !253, size: 16, offset: 80)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !139, line: 31, baseType: !45)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !241, file: !242, line: 103, baseType: !255, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !139, line: 27, baseType: !48)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !241, file: !242, line: 104, baseType: !255, size: 32, offset: 128)
!257 = !DILocation(line: 80, column: 57, scope: !232, inlinedAt: !258)
!258 = distinct !DILocation(line: 144, column: 8, scope: !259)
!259 = distinct !DILexicalBlock(scope: !260, file: !3, line: 144, column: 7)
!260 = distinct !DILexicalBlock(scope: !261, file: !3, line: 143, column: 40)
!261 = distinct !DILexicalBlock(scope: !92, file: !3, line: 143, column: 6)
!262 = !DILocation(line: 86, column: 10, scope: !263, inlinedAt: !258)
!263 = distinct !DILexicalBlock(scope: !232, file: !3, line: 86, column: 6)
!264 = !DILocation(line: 86, column: 14, scope: !263, inlinedAt: !258)
!265 = !DILocation(line: 86, column: 6, scope: !232, inlinedAt: !258)
!266 = !DILocation(line: 89, column: 11, scope: !267, inlinedAt: !258)
!267 = distinct !DILexicalBlock(scope: !232, file: !3, line: 89, column: 6)
!268 = !DILocation(line: 89, column: 15, scope: !267, inlinedAt: !258)
!269 = !DILocation(line: 89, column: 6, scope: !232, inlinedAt: !258)
!270 = !DILocation(line: 92, column: 16, scope: !232, inlinedAt: !258)
!271 = !{!272, !198, i64 12}
!272 = !{!"iphdr", !199, i64 0, !199, i64 0, !199, i64 1, !228, i64 2, !228, i64 4, !228, i64 6, !199, i64 8, !199, i64 9, !228, i64 10, !198, i64 12, !198, i64 16}
!273 = !DILocation(line: 93, column: 16, scope: !232, inlinedAt: !258)
!274 = !{!272, !198, i64 16}
!275 = !DILocation(line: 94, column: 21, scope: !232, inlinedAt: !258)
!276 = !DILocation(line: 144, column: 7, scope: !260)
!277 = !DILocalVariable(name: "off", arg: 2, scope: !278, file: !3, line: 99, type: !78)
!278 = distinct !DISubprogram(name: "parse_ip6", scope: !3, file: !3, line: 99, type: !233, isLocal: true, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !279)
!279 = !{!280, !277, !281, !282, !283}
!280 = !DILocalVariable(name: "data", arg: 1, scope: !278, file: !3, line: 99, type: !43)
!281 = !DILocalVariable(name: "data_end", arg: 3, scope: !278, file: !3, line: 99, type: !43)
!282 = !DILocalVariable(name: "f", arg: 4, scope: !278, file: !3, line: 100, type: !106)
!283 = !DILocalVariable(name: "ip6h", scope: !278, file: !3, line: 102, type: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !286, line: 116, size: 320, elements: !287)
!286 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!287 = !{!288, !289, !290, !294, !295, !296, !297, !312}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !285, file: !286, line: 118, baseType: !121, size: 4, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !285, file: !286, line: 119, baseType: !121, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !285, file: !286, line: 126, baseType: !291, size: 24, offset: 8)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 24, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 3)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !285, file: !286, line: 128, baseType: !138, size: 16, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !285, file: !286, line: 129, baseType: !121, size: 8, offset: 48)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !285, file: !286, line: 130, baseType: !121, size: 8, offset: 56)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !285, file: !286, line: 132, baseType: !298, size: 128, offset: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !299, line: 33, size: 128, elements: !300)
!299 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !298, file: !299, line: 40, baseType: !302, size: 128)
!302 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !298, file: !299, line: 34, size: 128, elements: !303)
!303 = !{!304, !306, !310}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !302, file: !299, line: 35, baseType: !305, size: 128)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 128, elements: !159)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !302, file: !299, line: 37, baseType: !307, size: 128)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 128, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 8)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !302, file: !299, line: 38, baseType: !311, size: 128)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 128, elements: !55)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !285, file: !286, line: 133, baseType: !298, size: 128, offset: 192)
!313 = !DILocation(line: 99, column: 57, scope: !278, inlinedAt: !314)
!314 = distinct !DILocation(line: 148, column: 8, scope: !315)
!315 = distinct !DILexicalBlock(scope: !316, file: !3, line: 148, column: 7)
!316 = distinct !DILexicalBlock(scope: !317, file: !3, line: 147, column: 49)
!317 = distinct !DILexicalBlock(scope: !261, file: !3, line: 147, column: 13)
!318 = !DILocation(line: 102, column: 18, scope: !278, inlinedAt: !314)
!319 = !DILocation(line: 105, column: 11, scope: !320, inlinedAt: !314)
!320 = distinct !DILexicalBlock(scope: !278, file: !3, line: 105, column: 6)
!321 = !DILocation(line: 105, column: 15, scope: !320, inlinedAt: !314)
!322 = !DILocation(line: 105, column: 6, scope: !278, inlinedAt: !314)
!323 = !DILocation(line: 108, column: 2, scope: !278, inlinedAt: !314)
!324 = !DILocation(line: 109, column: 2, scope: !278, inlinedAt: !314)
!325 = !DILocation(line: 110, column: 22, scope: !278, inlinedAt: !314)
!326 = !DILocation(line: 148, column: 7, scope: !316)
!327 = !{!199, !199, i64 0}
!328 = !DILocation(line: 157, column: 6, scope: !92)
!329 = !DILocation(line: 163, column: 7, scope: !330)
!330 = distinct !DILexicalBlock(scope: !331, file: !3, line: 157, column: 34)
!331 = distinct !DILexicalBlock(scope: !92, file: !3, line: 157, column: 6)
!332 = !DILocation(line: 164, column: 2, scope: !330)
!333 = !DILocation(line: 170, column: 7, scope: !334)
!334 = distinct !DILexicalBlock(scope: !335, file: !3, line: 164, column: 41)
!335 = distinct !DILexicalBlock(scope: !331, file: !3, line: 164, column: 13)
!336 = !DILocation(line: 171, column: 2, scope: !334)
!337 = !DILocation(line: 173, column: 11, scope: !338)
!338 = distinct !DILexicalBlock(scope: !92, file: !3, line: 173, column: 6)
!339 = !DILocation(line: 173, column: 17, scope: !338)
!340 = !DILocation(line: 173, column: 6, scope: !92)
!341 = !DILocation(line: 178, column: 6, scope: !92)
!342 = !DILocalVariable(name: "data", arg: 1, scope: !343, file: !3, line: 65, type: !43)
!343 = distinct !DISubprogram(name: "parse_tcp", scope: !3, file: !3, line: 65, type: !233, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !344)
!344 = !{!342, !345, !346, !347, !348}
!345 = !DILocalVariable(name: "off", arg: 2, scope: !343, file: !3, line: 65, type: !78)
!346 = !DILocalVariable(name: "data_end", arg: 3, scope: !343, file: !3, line: 65, type: !43)
!347 = !DILocalVariable(name: "f", arg: 4, scope: !343, file: !3, line: 66, type: !106)
!348 = !DILocalVariable(name: "tcp", scope: !343, file: !3, line: 68, type: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !351, line: 25, size: 160, elements: !352)
!351 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !350, file: !351, line: 26, baseType: !138, size: 16)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !350, file: !351, line: 27, baseType: !138, size: 16, offset: 16)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !350, file: !351, line: 28, baseType: !255, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !350, file: !351, line: 29, baseType: !255, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !350, file: !351, line: 31, baseType: !45, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !350, file: !351, line: 32, baseType: !45, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !350, file: !351, line: 33, baseType: !45, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !350, file: !351, line: 34, baseType: !45, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !350, file: !351, line: 35, baseType: !45, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !350, file: !351, line: 36, baseType: !45, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !350, file: !351, line: 37, baseType: !45, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !350, file: !351, line: 38, baseType: !45, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !350, file: !351, line: 39, baseType: !45, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !350, file: !351, line: 40, baseType: !45, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !350, file: !351, line: 55, baseType: !138, size: 16, offset: 112)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !350, file: !351, line: 56, baseType: !253, size: 16, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !350, file: !351, line: 57, baseType: !138, size: 16, offset: 144)
!370 = !DILocation(line: 65, column: 45, scope: !343, inlinedAt: !371)
!371 = distinct !DILocation(line: 179, column: 8, scope: !372)
!372 = distinct !DILexicalBlock(scope: !373, file: !3, line: 179, column: 7)
!373 = distinct !DILexicalBlock(scope: !374, file: !3, line: 178, column: 33)
!374 = distinct !DILexicalBlock(scope: !92, file: !3, line: 178, column: 6)
!375 = !DILocation(line: 65, column: 57, scope: !343, inlinedAt: !371)
!376 = !DILocation(line: 65, column: 68, scope: !343, inlinedAt: !371)
!377 = !DILocation(line: 66, column: 29, scope: !343, inlinedAt: !371)
!378 = !DILocation(line: 68, column: 17, scope: !343, inlinedAt: !371)
!379 = !DILocation(line: 71, column: 10, scope: !380, inlinedAt: !371)
!380 = distinct !DILexicalBlock(scope: !343, file: !3, line: 71, column: 6)
!381 = !DILocation(line: 71, column: 14, scope: !380, inlinedAt: !371)
!382 = !DILocation(line: 71, column: 6, scope: !343, inlinedAt: !371)
!383 = !DILocation(line: 74, column: 17, scope: !343, inlinedAt: !371)
!384 = !{!385, !228, i64 0}
!385 = !{!"tcphdr", !228, i64 0, !228, i64 2, !198, i64 4, !198, i64 8, !228, i64 12, !228, i64 12, !228, i64 13, !228, i64 13, !228, i64 13, !228, i64 13, !228, i64 13, !228, i64 13, !228, i64 13, !228, i64 13, !228, i64 14, !228, i64 16, !228, i64 18}
!386 = !DILocation(line: 75, column: 17, scope: !343, inlinedAt: !371)
!387 = !{!385, !228, i64 2}
!388 = !DILocation(line: 76, column: 15, scope: !343, inlinedAt: !371)
!389 = !DILocation(line: 76, column: 37, scope: !343, inlinedAt: !371)
!390 = !DILocation(line: 76, column: 44, scope: !343, inlinedAt: !371)
!391 = !DILocation(line: 179, column: 7, scope: !373)
!392 = !DILocalVariable(name: "data", arg: 1, scope: !393, file: !3, line: 50, type: !43)
!393 = distinct !DISubprogram(name: "parse_udp", scope: !3, file: !3, line: 50, type: !233, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !394)
!394 = !{!392, !395, !396, !397, !398}
!395 = !DILocalVariable(name: "off", arg: 2, scope: !393, file: !3, line: 50, type: !78)
!396 = !DILocalVariable(name: "data_end", arg: 3, scope: !393, file: !3, line: 50, type: !43)
!397 = !DILocalVariable(name: "f", arg: 4, scope: !393, file: !3, line: 51, type: !106)
!398 = !DILocalVariable(name: "udp", scope: !393, file: !3, line: 53, type: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !401, line: 23, size: 64, elements: !402)
!401 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!402 = !{!403, !404, !405, !406}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !400, file: !401, line: 24, baseType: !138, size: 16)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !400, file: !401, line: 25, baseType: !138, size: 16, offset: 16)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !400, file: !401, line: 26, baseType: !138, size: 16, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !400, file: !401, line: 27, baseType: !253, size: 16, offset: 48)
!407 = !DILocation(line: 50, column: 45, scope: !393, inlinedAt: !408)
!408 = distinct !DILocation(line: 182, column: 8, scope: !409)
!409 = distinct !DILexicalBlock(scope: !410, file: !3, line: 182, column: 7)
!410 = distinct !DILexicalBlock(scope: !411, file: !3, line: 181, column: 40)
!411 = distinct !DILexicalBlock(scope: !374, file: !3, line: 181, column: 13)
!412 = !DILocation(line: 50, column: 57, scope: !393, inlinedAt: !408)
!413 = !DILocation(line: 50, column: 68, scope: !393, inlinedAt: !408)
!414 = !DILocation(line: 51, column: 29, scope: !393, inlinedAt: !408)
!415 = !DILocation(line: 53, column: 17, scope: !393, inlinedAt: !408)
!416 = !DILocation(line: 56, column: 10, scope: !417, inlinedAt: !408)
!417 = distinct !DILexicalBlock(scope: !393, file: !3, line: 56, column: 6)
!418 = !DILocation(line: 56, column: 14, scope: !417, inlinedAt: !408)
!419 = !DILocation(line: 56, column: 6, scope: !393, inlinedAt: !408)
!420 = !DILocation(line: 59, column: 17, scope: !393, inlinedAt: !408)
!421 = !{!422, !228, i64 0}
!422 = !{!"udphdr", !228, i64 0, !228, i64 2, !228, i64 4, !228, i64 6}
!423 = !DILocation(line: 60, column: 17, scope: !393, inlinedAt: !408)
!424 = !{!422, !228, i64 2}
!425 = !DILocation(line: 182, column: 7, scope: !410)
!426 = !DILocalVariable(name: "f", arg: 1, scope: !427, file: !3, line: 35, type: !106)
!427 = distinct !DISubprogram(name: "hash_tuples", scope: !3, file: !3, line: 35, type: !428, isLocal: true, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !430)
!428 = !DISubroutineType(types: !429)
!429 = !{!48, !106, !142}
!430 = !{!426, !431, !432, !433}
!431 = !DILocalVariable(name: "is_ip6", arg: 2, scope: !427, file: !3, line: 35, type: !142)
!432 = !DILocalVariable(name: "a", scope: !427, file: !3, line: 37, type: !48)
!433 = !DILocalVariable(name: "b", scope: !427, file: !3, line: 38, type: !48)
!434 = !DILocation(line: 35, column: 60, scope: !427, inlinedAt: !435)
!435 = distinct !DILocation(line: 191, column: 10, scope: !436)
!436 = distinct !DILexicalBlock(scope: !437, file: !3, line: 189, column: 13)
!437 = distinct !DILexicalBlock(scope: !92, file: !3, line: 189, column: 6)
!438 = !DILocation(line: 35, column: 68, scope: !427, inlinedAt: !435)
!439 = !DILocation(line: 41, column: 6, scope: !427, inlinedAt: !435)
!440 = !DILocalVariable(name: "length", arg: 2, scope: !441, file: !442, line: 114, type: !445)
!441 = distinct !DISubprogram(name: "jhash2", scope: !442, file: !442, line: 114, type: !443, isLocal: true, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !448)
!442 = !DIFile(filename: "./../dependencies/headers/jhash.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!443 = !DISubroutineType(types: !444)
!444 = !{!445, !446, !445, !445}
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !442, line: 56, baseType: !49)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!448 = !{!449, !440, !450, !451, !452, !453}
!449 = !DILocalVariable(name: "k", arg: 1, scope: !441, file: !442, line: 114, type: !446)
!450 = !DILocalVariable(name: "initval", arg: 3, scope: !441, file: !442, line: 114, type: !445)
!451 = !DILocalVariable(name: "a", scope: !441, file: !442, line: 116, type: !445)
!452 = !DILocalVariable(name: "b", scope: !441, file: !442, line: 116, type: !445)
!453 = !DILocalVariable(name: "c", scope: !441, file: !442, line: 116, type: !445)
!454 = !DILocation(line: 114, column: 44, scope: !441, inlinedAt: !455)
!455 = distinct !DILocation(line: 42, column: 7, scope: !456, inlinedAt: !435)
!456 = distinct !DILexicalBlock(scope: !457, file: !3, line: 41, column: 14)
!457 = distinct !DILexicalBlock(scope: !427, file: !3, line: 41, column: 6)
