; ModuleID = 'xdp_prog_kern_flow.c'
source_filename = "xdp_prog_kern_flow.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.flow_meta = type { i32, i32, [4 x i32], [4 x i32], i32, [2 x i16], i8, i32, i64, i64, i64 }

@flow_map = global %struct.bpf_map_def { i32 2, i32 4, i32 80, i32 200000, i32 0 }, section "maps", align 4, !dbg !0
@process_packet.____fmt = private unnamed_addr constant [16 x i8] c"Init new flow \0A\00", align 1
@process_packet.____fmt.1 = private unnamed_addr constant [35 x i8] c"Last flow modification time: %ld \0A\00", align 1
@process_packet.____fmt.2 = private unnamed_addr constant [16 x i8] c"Updating flow \0A\00", align 1
@process_packet.____fmt.3 = private unnamed_addr constant [18 x i8] c"Reuse old entry \0A\00", align 1
@process_packet.____fmt.4 = private unnamed_addr constant [15 x i8] c"Flow ignored \0A\00", align 1
@process_packet.____fmt.5 = private unnamed_addr constant [31 x i8] c"Count for key:%d , count: %d \0A\00", align 1
@process_packet.____fmt.6 = private unnamed_addr constant [35 x i8] c"Size for key:%d , size: %d bytes \0A\00", align 1
@process_packet.____fmt.7 = private unnamed_addr constant [15 x i8] c"Ports: %u %u \0A\00", align 1
@_license = global [4 x i8] c"GPL\00", section "license", align 1, !dbg !51

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "flow_map", scope: !2, file: !3, line: 28, type: !80, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !42, globals: !50)
!3 = !DIFile(filename: "xdp_prog_kern_flow.c", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 876, size: 32, elements: !7)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!9 = !DIEnumerator(name: "XDP_DROP", value: 1)
!10 = !DIEnumerator(name: "XDP_PASS", value: 2)
!11 = !DIEnumerator(name: "XDP_TX", value: 3)
!12 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 28, size: 32, elements: !15)
!14 = !DIFile(filename: "/usr/include/linux/in.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!16 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!17 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!18 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!19 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!20 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!21 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!22 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!23 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!24 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!25 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!26 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!27 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!28 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!29 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!30 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!31 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!32 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!33 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!34 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!35 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!36 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!37 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!38 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!39 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!40 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!41 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!42 = !{!43, !44, !45, !48}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !46, line: 24, baseType: !47)
!46 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !46, line: 27, baseType: !49)
!49 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!50 = !{!0, !51, !57, !65, !73}
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 279, type: !53, isLocal: false, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 32, elements: !55)
!54 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!55 = !{!56}
!56 = !DISubrange(count: 4)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !59, line: 33, type: !60, isLocal: true, isDefinition: true)
!59 = !DIFile(filename: "../dependencies/libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!43, !43, !63}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !59, line: 152, type: !67, isLocal: true, isDefinition: true)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !71, !48, null}
!70 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !59, line: 89, type: !75, isLocal: true, isDefinition: true)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !46, line: 31, baseType: !79)
!79 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !81, line: 33, size: 160, elements: !82)
!81 = !DIFile(filename: "../dependencies/libbpf/src//build/usr/include/bpf/bpf_helpers.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!82 = !{!83, !84, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !81, line: 34, baseType: !49, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !80, file: !81, line: 35, baseType: !49, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !80, file: !81, line: 36, baseType: !49, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !80, file: !81, line: 37, baseType: !49, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !80, file: !81, line: 38, baseType: !49, size: 32, offset: 128)
!88 = !{i32 2, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{i32 1, !"wchar_size", i32 4}
!91 = !{!"clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)"}
!92 = distinct !DISubprogram(name: "process_packet", scope: !3, file: !3, line: 120, type: !93, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !101)
!93 = !DISubroutineType(types: !94)
!94 = !{!70, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 887, size: 96, elements: !97)
!97 = !{!98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !6, line: 888, baseType: !48, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !96, file: !6, line: 889, baseType: !48, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !96, file: !6, line: 890, baseType: !48, size: 32, offset: 64)
!101 = !{!102, !103, !104, !105, !127, !140, !141, !143, !144, !145, !146, !147, !148, !149, !156, !161, !166, !174, !180, !185, !187}
!102 = !DILocalVariable(name: "ctx", arg: 1, scope: !92, file: !3, line: 120, type: !95)
!103 = !DILocalVariable(name: "data_end", scope: !92, file: !3, line: 122, type: !43)
!104 = !DILocalVariable(name: "data", scope: !92, file: !3, line: 123, type: !43)
!105 = !DILocalVariable(name: "v", scope: !92, file: !3, line: 124, type: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_meta", file: !108, line: 10, size: 640, elements: !109)
!108 = !DIFile(filename: "./common_kern_user.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!109 = !{!110, !111, !112, !114, !115, !116, !120, !123, !124, !125, !126}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !107, file: !108, line: 11, baseType: !48, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !107, file: !108, line: 12, baseType: !48, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "srcv6", scope: !107, file: !108, line: 13, baseType: !113, size: 128, offset: 64)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 128, elements: !55)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !107, file: !108, line: 14, baseType: !113, size: 128, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ports", scope: !107, file: !108, line: 15, baseType: !48, size: 32, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "port16", scope: !107, file: !108, line: 16, baseType: !117, size: 32, offset: 352)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 32, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 2)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !107, file: !108, line: 17, baseType: !121, size: 8, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !46, line: 21, baseType: !122)
!122 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !107, file: !108, line: 18, baseType: !48, size: 32, offset: 416)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !107, file: !108, line: 19, baseType: !78, size: 64, offset: 448)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_start", scope: !107, file: !108, line: 20, baseType: !78, size: 64, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_last_m", scope: !107, file: !108, line: 21, baseType: !78, size: 64, offset: 576)
!127 = !DILocalVariable(name: "eth", scope: !92, file: !3, line: 125, type: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !130, line: 159, size: 112, elements: !131)
!130 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!131 = !{!132, !136, !137}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !129, file: !130, line: 160, baseType: !133, size: 48)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 48, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 6)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !129, file: !130, line: 161, baseType: !133, size: 48, offset: 48)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !129, file: !130, line: 162, baseType: !138, size: 16, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !139, line: 25, baseType: !45)
!139 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!140 = !DILocalVariable(name: "f", scope: !92, file: !3, line: 126, type: !107)
!141 = !DILocalVariable(name: "use_encap", scope: !92, file: !3, line: 127, type: !142)
!142 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!143 = !DILocalVariable(name: "is_ip6", scope: !92, file: !3, line: 128, type: !142)
!144 = !DILocalVariable(name: "jhash", scope: !92, file: !3, line: 129, type: !142)
!145 = !DILocalVariable(name: "eth_proto", scope: !92, file: !3, line: 130, type: !48)
!146 = !DILocalVariable(name: "hash", scope: !92, file: !3, line: 131, type: !48)
!147 = !DILocalVariable(name: "key", scope: !92, file: !3, line: 132, type: !48)
!148 = !DILocalVariable(name: "off", scope: !92, file: !3, line: 133, type: !48)
!149 = !DILocalVariable(name: "____fmt", scope: !150, file: !3, line: 223, type: !153)
!150 = distinct !DILexicalBlock(scope: !151, file: !3, line: 223, column: 3)
!151 = distinct !DILexicalBlock(scope: !152, file: !3, line: 222, column: 2)
!152 = distinct !DILexicalBlock(scope: !92, file: !3, line: 221, column: 5)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 128, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 16)
!156 = !DILocalVariable(name: "____fmt", scope: !157, file: !3, line: 232, type: !158)
!157 = distinct !DILexicalBlock(scope: !151, file: !3, line: 232, column: 3)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 280, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 35)
!161 = !DILocalVariable(name: "____fmt", scope: !162, file: !3, line: 239, type: !153)
!162 = distinct !DILexicalBlock(scope: !163, file: !3, line: 239, column: 4)
!163 = distinct !DILexicalBlock(scope: !164, file: !3, line: 237, column: 3)
!164 = distinct !DILexicalBlock(scope: !165, file: !3, line: 236, column: 6)
!165 = distinct !DILexicalBlock(scope: !152, file: !3, line: 235, column: 2)
!166 = !DILocalVariable(name: "____fmt", scope: !167, file: !3, line: 250, type: !171)
!167 = distinct !DILexicalBlock(scope: !168, file: !3, line: 250, column: 5)
!168 = distinct !DILexicalBlock(scope: !169, file: !3, line: 248, column: 4)
!169 = distinct !DILexicalBlock(scope: !170, file: !3, line: 247, column: 7)
!170 = distinct !DILexicalBlock(scope: !164, file: !3, line: 245, column: 3)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 144, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 18)
!174 = !DILocalVariable(name: "____fmt", scope: !175, file: !3, line: 265, type: !177)
!175 = distinct !DILexicalBlock(scope: !176, file: !3, line: 265, column: 5)
!176 = distinct !DILexicalBlock(scope: !169, file: !3, line: 264, column: 4)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 120, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 15)
!180 = !DILocalVariable(name: "____fmt", scope: !181, file: !3, line: 270, type: !182)
!181 = distinct !DILexicalBlock(scope: !92, file: !3, line: 270, column: 2)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 248, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 31)
!185 = !DILocalVariable(name: "____fmt", scope: !186, file: !3, line: 271, type: !158)
!186 = distinct !DILexicalBlock(scope: !92, file: !3, line: 271, column: 2)
!187 = !DILocalVariable(name: "____fmt", scope: !188, file: !3, line: 272, type: !177)
!188 = distinct !DILexicalBlock(scope: !92, file: !3, line: 272, column: 2)
!189 = !DILocation(line: 120, column: 35, scope: !92)
!190 = !DILocation(line: 122, column: 38, scope: !92)
!191 = !{!192, !193, i64 4}
!192 = !{!"xdp_md", !193, i64 0, !193, i64 4, !193, i64 8}
!193 = !{!"int", !194, i64 0}
!194 = !{!"omnipotent char", !195, i64 0}
!195 = !{!"Simple C/C++ TBAA"}
!196 = !DILocation(line: 122, column: 27, scope: !92)
!197 = !DILocation(line: 122, column: 19, scope: !92)
!198 = !DILocation(line: 122, column: 8, scope: !92)
!199 = !DILocation(line: 123, column: 34, scope: !92)
!200 = !{!192, !193, i64 0}
!201 = !DILocation(line: 123, column: 23, scope: !92)
!202 = !DILocation(line: 123, column: 15, scope: !92)
!203 = !DILocation(line: 123, column: 8, scope: !92)
!204 = !DILocation(line: 125, column: 17, scope: !92)
!205 = !DILocation(line: 127, column: 7, scope: !92)
!206 = !DILocation(line: 128, column: 7, scope: !92)
!207 = !DILocation(line: 129, column: 7, scope: !92)
!208 = !DILocation(line: 132, column: 2, scope: !92)
!209 = !DILocation(line: 132, column: 8, scope: !92)
!210 = !DILocation(line: 135, column: 6, scope: !92)
!211 = !{!193, !193, i64 0}
!212 = !DILocation(line: 133, column: 8, scope: !92)
!213 = !DILocation(line: 140, column: 11, scope: !214)
!214 = distinct !DILexicalBlock(scope: !92, file: !3, line: 140, column: 6)
!215 = !DILocation(line: 140, column: 17, scope: !214)
!216 = !DILocation(line: 140, column: 6, scope: !92)
!217 = !DILocation(line: 125, column: 23, scope: !92)
!218 = !DILocation(line: 143, column: 19, scope: !92)
!219 = !{!220, !221, i64 12}
!220 = !{!"ethhdr", !194, i64 0, !194, i64 6, !221, i64 12}
!221 = !{!"short", !194, i64 0}
!222 = !DILocation(line: 145, column: 6, scope: !92)
!223 = !DILocation(line: 126, column: 19, scope: !92)
!224 = !DILocalVariable(name: "off", arg: 2, scope: !225, file: !3, line: 83, type: !78)
!225 = distinct !DISubprogram(name: "parse_ip4", scope: !3, file: !3, line: 83, type: !226, isLocal: true, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !228)
!226 = !DISubroutineType(types: !227)
!227 = !{!142, !43, !78, !43, !106}
!228 = !{!229, !224, !230, !231, !232}
!229 = !DILocalVariable(name: "data", arg: 1, scope: !225, file: !3, line: 83, type: !43)
!230 = !DILocalVariable(name: "data_end", arg: 3, scope: !225, file: !3, line: 83, type: !43)
!231 = !DILocalVariable(name: "f", arg: 4, scope: !225, file: !3, line: 84, type: !106)
!232 = !DILocalVariable(name: "iph", scope: !225, file: !3, line: 86, type: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !235, line: 86, size: 160, elements: !236)
!235 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !247, !249}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !234, file: !235, line: 88, baseType: !121, size: 4, flags: DIFlagBitField, extraData: i64 0)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !234, file: !235, line: 89, baseType: !121, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !234, file: !235, line: 96, baseType: !121, size: 8, offset: 8)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !234, file: !235, line: 97, baseType: !138, size: 16, offset: 16)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !234, file: !235, line: 98, baseType: !138, size: 16, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !234, file: !235, line: 99, baseType: !138, size: 16, offset: 48)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !234, file: !235, line: 100, baseType: !121, size: 8, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !234, file: !235, line: 101, baseType: !121, size: 8, offset: 72)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !234, file: !235, line: 102, baseType: !246, size: 16, offset: 80)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !139, line: 31, baseType: !45)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !234, file: !235, line: 103, baseType: !248, size: 32, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !139, line: 27, baseType: !48)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !234, file: !235, line: 104, baseType: !248, size: 32, offset: 128)
!250 = !DILocation(line: 83, column: 57, scope: !225, inlinedAt: !251)
!251 = distinct !DILocation(line: 147, column: 8, scope: !252)
!252 = distinct !DILexicalBlock(scope: !253, file: !3, line: 147, column: 7)
!253 = distinct !DILexicalBlock(scope: !254, file: !3, line: 146, column: 2)
!254 = distinct !DILexicalBlock(scope: !92, file: !3, line: 145, column: 6)
!255 = !DILocation(line: 89, column: 10, scope: !256, inlinedAt: !251)
!256 = distinct !DILexicalBlock(scope: !225, file: !3, line: 89, column: 6)
!257 = !DILocation(line: 89, column: 14, scope: !256, inlinedAt: !251)
!258 = !DILocation(line: 89, column: 6, scope: !225, inlinedAt: !251)
!259 = !DILocation(line: 92, column: 11, scope: !260, inlinedAt: !251)
!260 = distinct !DILexicalBlock(scope: !225, file: !3, line: 92, column: 6)
!261 = !DILocation(line: 92, column: 15, scope: !260, inlinedAt: !251)
!262 = !DILocation(line: 92, column: 6, scope: !225, inlinedAt: !251)
!263 = !DILocation(line: 95, column: 16, scope: !225, inlinedAt: !251)
!264 = !{!265, !193, i64 12}
!265 = !{!"iphdr", !194, i64 0, !194, i64 0, !194, i64 1, !221, i64 2, !221, i64 4, !221, i64 6, !194, i64 8, !194, i64 9, !221, i64 10, !193, i64 12, !193, i64 16}
!266 = !DILocation(line: 96, column: 16, scope: !225, inlinedAt: !251)
!267 = !{!265, !193, i64 16}
!268 = !DILocation(line: 97, column: 21, scope: !225, inlinedAt: !251)
!269 = !DILocation(line: 147, column: 7, scope: !253)
!270 = !DILocalVariable(name: "off", arg: 2, scope: !271, file: !3, line: 102, type: !78)
!271 = distinct !DISubprogram(name: "parse_ip6", scope: !3, file: !3, line: 102, type: !226, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !272)
!272 = !{!273, !270, !274, !275, !276}
!273 = !DILocalVariable(name: "data", arg: 1, scope: !271, file: !3, line: 102, type: !43)
!274 = !DILocalVariable(name: "data_end", arg: 3, scope: !271, file: !3, line: 102, type: !43)
!275 = !DILocalVariable(name: "f", arg: 4, scope: !271, file: !3, line: 103, type: !106)
!276 = !DILocalVariable(name: "ip6h", scope: !271, file: !3, line: 105, type: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !279, line: 116, size: 320, elements: !280)
!279 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!280 = !{!281, !282, !283, !287, !288, !289, !290, !305}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !278, file: !279, line: 118, baseType: !121, size: 4, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !278, file: !279, line: 119, baseType: !121, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !278, file: !279, line: 126, baseType: !284, size: 24, offset: 8)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 24, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 3)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !278, file: !279, line: 128, baseType: !138, size: 16, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !278, file: !279, line: 129, baseType: !121, size: 8, offset: 48)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !278, file: !279, line: 130, baseType: !121, size: 8, offset: 56)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !278, file: !279, line: 132, baseType: !291, size: 128, offset: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !292, line: 33, size: 128, elements: !293)
!292 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !291, file: !292, line: 40, baseType: !295, size: 128)
!295 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !291, file: !292, line: 34, size: 128, elements: !296)
!296 = !{!297, !299, !303}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !295, file: !292, line: 35, baseType: !298, size: 128)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 128, elements: !154)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !295, file: !292, line: 37, baseType: !300, size: 128)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 128, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 8)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !295, file: !292, line: 38, baseType: !304, size: 128)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 128, elements: !55)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !278, file: !279, line: 133, baseType: !291, size: 128, offset: 192)
!306 = !DILocation(line: 102, column: 57, scope: !271, inlinedAt: !307)
!307 = distinct !DILocation(line: 153, column: 8, scope: !308)
!308 = distinct !DILexicalBlock(scope: !309, file: !3, line: 153, column: 7)
!309 = distinct !DILexicalBlock(scope: !310, file: !3, line: 152, column: 2)
!310 = distinct !DILexicalBlock(scope: !254, file: !3, line: 151, column: 11)
!311 = !DILocation(line: 105, column: 18, scope: !271, inlinedAt: !307)
!312 = !DILocation(line: 108, column: 11, scope: !313, inlinedAt: !307)
!313 = distinct !DILexicalBlock(scope: !271, file: !3, line: 108, column: 6)
!314 = !DILocation(line: 108, column: 15, scope: !313, inlinedAt: !307)
!315 = !DILocation(line: 108, column: 6, scope: !271, inlinedAt: !307)
!316 = !DILocation(line: 111, column: 2, scope: !271, inlinedAt: !307)
!317 = !DILocation(line: 112, column: 2, scope: !271, inlinedAt: !307)
!318 = !DILocation(line: 113, column: 22, scope: !271, inlinedAt: !307)
!319 = !DILocation(line: 153, column: 7, scope: !309)
!320 = !{!194, !194, i64 0}
!321 = !DILocation(line: 164, column: 6, scope: !92)
!322 = !DILocation(line: 172, column: 7, scope: !323)
!323 = distinct !DILexicalBlock(scope: !324, file: !3, line: 165, column: 2)
!324 = distinct !DILexicalBlock(scope: !92, file: !3, line: 164, column: 6)
!325 = !DILocation(line: 173, column: 2, scope: !323)
!326 = !DILocation(line: 182, column: 7, scope: !327)
!327 = distinct !DILexicalBlock(scope: !328, file: !3, line: 175, column: 2)
!328 = distinct !DILexicalBlock(scope: !324, file: !3, line: 174, column: 11)
!329 = !DILocation(line: 183, column: 2, scope: !327)
!330 = !DILocation(line: 185, column: 11, scope: !331)
!331 = distinct !DILexicalBlock(scope: !92, file: !3, line: 185, column: 6)
!332 = !DILocation(line: 185, column: 17, scope: !331)
!333 = !DILocation(line: 185, column: 6, scope: !92)
!334 = !DILocation(line: 190, column: 6, scope: !92)
!335 = !DILocalVariable(name: "data", arg: 1, scope: !336, file: !3, line: 68, type: !43)
!336 = distinct !DISubprogram(name: "parse_tcp", scope: !3, file: !3, line: 68, type: !226, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !337)
!337 = !{!335, !338, !339, !340, !341}
!338 = !DILocalVariable(name: "off", arg: 2, scope: !336, file: !3, line: 68, type: !78)
!339 = !DILocalVariable(name: "data_end", arg: 3, scope: !336, file: !3, line: 68, type: !43)
!340 = !DILocalVariable(name: "f", arg: 4, scope: !336, file: !3, line: 69, type: !106)
!341 = !DILocalVariable(name: "tcp", scope: !336, file: !3, line: 71, type: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !344, line: 25, size: 160, elements: !345)
!344 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!345 = !{!346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !343, file: !344, line: 26, baseType: !138, size: 16)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !343, file: !344, line: 27, baseType: !138, size: 16, offset: 16)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !343, file: !344, line: 28, baseType: !248, size: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !343, file: !344, line: 29, baseType: !248, size: 32, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !343, file: !344, line: 31, baseType: !45, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !343, file: !344, line: 32, baseType: !45, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !343, file: !344, line: 33, baseType: !45, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !343, file: !344, line: 34, baseType: !45, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !343, file: !344, line: 35, baseType: !45, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !343, file: !344, line: 36, baseType: !45, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !343, file: !344, line: 37, baseType: !45, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !343, file: !344, line: 38, baseType: !45, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !343, file: !344, line: 39, baseType: !45, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !343, file: !344, line: 40, baseType: !45, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !343, file: !344, line: 55, baseType: !138, size: 16, offset: 112)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !343, file: !344, line: 56, baseType: !246, size: 16, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !343, file: !344, line: 57, baseType: !138, size: 16, offset: 144)
!363 = !DILocation(line: 68, column: 45, scope: !336, inlinedAt: !364)
!364 = distinct !DILocation(line: 192, column: 8, scope: !365)
!365 = distinct !DILexicalBlock(scope: !366, file: !3, line: 192, column: 7)
!366 = distinct !DILexicalBlock(scope: !367, file: !3, line: 191, column: 2)
!367 = distinct !DILexicalBlock(scope: !92, file: !3, line: 190, column: 6)
!368 = !DILocation(line: 68, column: 57, scope: !336, inlinedAt: !364)
!369 = !DILocation(line: 68, column: 68, scope: !336, inlinedAt: !364)
!370 = !DILocation(line: 69, column: 29, scope: !336, inlinedAt: !364)
!371 = !DILocation(line: 71, column: 17, scope: !336, inlinedAt: !364)
!372 = !DILocation(line: 74, column: 10, scope: !373, inlinedAt: !364)
!373 = distinct !DILexicalBlock(scope: !336, file: !3, line: 74, column: 6)
!374 = !DILocation(line: 74, column: 14, scope: !373, inlinedAt: !364)
!375 = !DILocation(line: 74, column: 6, scope: !336, inlinedAt: !364)
!376 = !DILocation(line: 77, column: 17, scope: !336, inlinedAt: !364)
!377 = !{!378, !221, i64 0}
!378 = !{!"tcphdr", !221, i64 0, !221, i64 2, !193, i64 4, !193, i64 8, !221, i64 12, !221, i64 12, !221, i64 13, !221, i64 13, !221, i64 13, !221, i64 13, !221, i64 13, !221, i64 13, !221, i64 13, !221, i64 13, !221, i64 14, !221, i64 16, !221, i64 18}
!379 = !DILocation(line: 78, column: 17, scope: !336, inlinedAt: !364)
!380 = !{!378, !221, i64 2}
!381 = !DILocation(line: 79, column: 15, scope: !336, inlinedAt: !364)
!382 = !DILocation(line: 79, column: 37, scope: !336, inlinedAt: !364)
!383 = !DILocation(line: 79, column: 44, scope: !336, inlinedAt: !364)
!384 = !DILocation(line: 192, column: 7, scope: !366)
!385 = !DILocalVariable(name: "data", arg: 1, scope: !386, file: !3, line: 53, type: !43)
!386 = distinct !DISubprogram(name: "parse_udp", scope: !3, file: !3, line: 53, type: !226, isLocal: true, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !387)
!387 = !{!385, !388, !389, !390, !391}
!388 = !DILocalVariable(name: "off", arg: 2, scope: !386, file: !3, line: 53, type: !78)
!389 = !DILocalVariable(name: "data_end", arg: 3, scope: !386, file: !3, line: 53, type: !43)
!390 = !DILocalVariable(name: "f", arg: 4, scope: !386, file: !3, line: 54, type: !106)
!391 = !DILocalVariable(name: "udp", scope: !386, file: !3, line: 56, type: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !394, line: 23, size: 64, elements: !395)
!394 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!395 = !{!396, !397, !398, !399}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !393, file: !394, line: 24, baseType: !138, size: 16)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !393, file: !394, line: 25, baseType: !138, size: 16, offset: 16)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !393, file: !394, line: 26, baseType: !138, size: 16, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !393, file: !394, line: 27, baseType: !246, size: 16, offset: 48)
!400 = !DILocation(line: 53, column: 45, scope: !386, inlinedAt: !401)
!401 = distinct !DILocation(line: 197, column: 8, scope: !402)
!402 = distinct !DILexicalBlock(scope: !403, file: !3, line: 197, column: 7)
!403 = distinct !DILexicalBlock(scope: !404, file: !3, line: 196, column: 2)
!404 = distinct !DILexicalBlock(scope: !367, file: !3, line: 195, column: 11)
!405 = !DILocation(line: 53, column: 57, scope: !386, inlinedAt: !401)
!406 = !DILocation(line: 53, column: 68, scope: !386, inlinedAt: !401)
!407 = !DILocation(line: 54, column: 29, scope: !386, inlinedAt: !401)
!408 = !DILocation(line: 56, column: 17, scope: !386, inlinedAt: !401)
!409 = !DILocation(line: 59, column: 10, scope: !410, inlinedAt: !401)
!410 = distinct !DILexicalBlock(scope: !386, file: !3, line: 59, column: 6)
!411 = !DILocation(line: 59, column: 14, scope: !410, inlinedAt: !401)
!412 = !DILocation(line: 59, column: 6, scope: !386, inlinedAt: !401)
!413 = !DILocation(line: 62, column: 17, scope: !386, inlinedAt: !401)
!414 = !{!415, !221, i64 0}
!415 = !{!"udphdr", !221, i64 0, !221, i64 2, !221, i64 4, !221, i64 6}
!416 = !DILocation(line: 63, column: 17, scope: !386, inlinedAt: !401)
!417 = !{!415, !221, i64 2}
!418 = !DILocation(line: 197, column: 7, scope: !403)
!419 = !DILocalVariable(name: "f", arg: 1, scope: !420, file: !3, line: 35, type: !106)
!420 = distinct !DISubprogram(name: "hash_tuples", scope: !3, file: !3, line: 35, type: !421, isLocal: true, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !423)
!421 = !DISubroutineType(types: !422)
!422 = !{!48, !106, !142}
!423 = !{!419, !424, !425, !426}
!424 = !DILocalVariable(name: "is_ip6", arg: 2, scope: !420, file: !3, line: 35, type: !142)
!425 = !DILocalVariable(name: "a", scope: !420, file: !3, line: 37, type: !48)
!426 = !DILocalVariable(name: "b", scope: !420, file: !3, line: 38, type: !48)
!427 = !DILocation(line: 35, column: 60, scope: !420, inlinedAt: !428)
!428 = distinct !DILocation(line: 209, column: 10, scope: !429)
!429 = distinct !DILexicalBlock(scope: !430, file: !3, line: 207, column: 2)
!430 = distinct !DILexicalBlock(scope: !92, file: !3, line: 206, column: 6)
!431 = !DILocation(line: 35, column: 68, scope: !420, inlinedAt: !428)
!432 = !DILocation(line: 41, column: 6, scope: !420, inlinedAt: !428)
!433 = !DILocalVariable(name: "length", arg: 2, scope: !434, file: !435, line: 114, type: !438)
!434 = distinct !DISubprogram(name: "jhash2", scope: !435, file: !435, line: 114, type: !436, isLocal: true, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !441)
!435 = !DIFile(filename: "./../dependencies/headers/jhash.h", directory: "/home/francois/Documents/TFE/XDP-Code/flow-stats")
!436 = !DISubroutineType(types: !437)
!437 = !{!438, !439, !438, !438}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !435, line: 56, baseType: !49)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !438)
!441 = !{!442, !433, !443, !444, !445, !446}
!442 = !DILocalVariable(name: "k", arg: 1, scope: !434, file: !435, line: 114, type: !439)
!443 = !DILocalVariable(name: "initval", arg: 3, scope: !434, file: !435, line: 114, type: !438)
!444 = !DILocalVariable(name: "a", scope: !434, file: !435, line: 116, type: !438)
!445 = !DILocalVariable(name: "b", scope: !434, file: !435, line: 116, type: !438)
!446 = !DILocalVariable(name: "c", scope: !434, file: !435, line: 116, type: !438)
!447 = !DILocation(line: 114, column: 44, scope: !434, inlinedAt: !448)
!448 = distinct !DILocation(line: 43, column: 7, scope: !449, inlinedAt: !428)
!449 = distinct !DILexicalBlock(scope: !450, file: !3, line: 42, column: 2)
!450 = distinct !DILexicalBlock(scope: !420, file: !3, line: 41, column: 6)
